apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_uhci.h
/****************************************************************************
 * arch/xtensa/src/esp32/hardware/esp32_uhci.h
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_XTENSA_SRC_ESP32_HARDWARE_ESP32_UHCI_H
#define __ARCH_XTENSA_SRC_ESP32_HARDWARE_ESP32_UHCI_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include "esp32_soc.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define REG_UHCI_BASE(i)         (DR_REG_UHCI0_BASE - (i) * 0x8000)

/* UHCI_CONF0_REG register */

#define UHCI_CONF0_REG(i) (REG_UHCI_BASE(i) + 0x0)

/* UHCI_UART_RX_BRK_EOF_EN : RW; bitpos: [23]; default: 0;
 * Set this bit to enable to use brk char as the end of a data frame.
 */

#define UHCI_UART_RX_BRK_EOF_EN    (BIT(23))
#define UHCI_UART_RX_BRK_EOF_EN_M  (UHCI_UART_RX_BRK_EOF_EN_V << UHCI_UART_RX_BRK_EOF_EN_S)
#define UHCI_UART_RX_BRK_EOF_EN_V  0x00000001
#define UHCI_UART_RX_BRK_EOF_EN_S  23

/* UHCI_CLK_EN : RW; bitpos: [22]; default: 0;
 * Set this bit to enable clock-gating for read or write registers.
 */

#define UHCI_CLK_EN    (BIT(22))
#define UHCI_CLK_EN_M  (UHCI_CLK_EN_V << UHCI_CLK_EN_S)
#define UHCI_CLK_EN_V  0x00000001
#define UHCI_CLK_EN_S  22

/* UHCI_ENCODE_CRC_EN : RW; bitpos: [21]; default: 1;
 * Set this bit to enable crc calculation for data frame when bit6 in the
 * head packet is 1.
 */

#define UHCI_ENCODE_CRC_EN    (BIT(21))
#define UHCI_ENCODE_CRC_EN_M  (UHCI_ENCODE_CRC_EN_V << UHCI_ENCODE_CRC_EN_S)
#define UHCI_ENCODE_CRC_EN_V  0x00000001
#define UHCI_ENCODE_CRC_EN_S  21

/* UHCI_LEN_EOF_EN : RW; bitpos: [20]; default: 1;
 * Set this bit to enable to use packet_len in packet head  when the
 * received data is equal to packet_len  this means the end of a data frame.
 */

#define UHCI_LEN_EOF_EN    (BIT(20))
#define UHCI_LEN_EOF_EN_M  (UHCI_LEN_EOF_EN_V << UHCI_LEN_EOF_EN_S)
#define UHCI_LEN_EOF_EN_V  0x00000001
#define UHCI_LEN_EOF_EN_S  20

/* UHCI_UART_IDLE_EOF_EN : RW; bitpos: [19]; default: 0;
 * Set this bit to enable to use idle time  when the idle time after data
 * frame is satisfied  this means the end of a data frame.
 */

#define UHCI_UART_IDLE_EOF_EN    (BIT(19))
#define UHCI_UART_IDLE_EOF_EN_M  (UHCI_UART_IDLE_EOF_EN_V << UHCI_UART_IDLE_EOF_EN_S)
#define UHCI_UART_IDLE_EOF_EN_V  0x00000001
#define UHCI_UART_IDLE_EOF_EN_S  19

/* UHCI_CRC_REC_EN : RW; bitpos: [18]; default: 1;
 * Set this bit to enable receiver''s ability of crc calculation  when
 * crc_en bit in head packet is 1 then there will be crc bytes after
 * data_frame
 */

#define UHCI_CRC_REC_EN    (BIT(18))
#define UHCI_CRC_REC_EN_M  (UHCI_CRC_REC_EN_V << UHCI_CRC_REC_EN_S)
#define UHCI_CRC_REC_EN_V  0x00000001
#define UHCI_CRC_REC_EN_S  18

/* UHCI_HEAD_EN : RW; bitpos: [17]; default: 1;
 * Set this bit to enable to use head packet  before the data frame.
 */

#define UHCI_HEAD_EN    (BIT(17))
#define UHCI_HEAD_EN_M  (UHCI_HEAD_EN_V << UHCI_HEAD_EN_S)
#define UHCI_HEAD_EN_V  0x00000001
#define UHCI_HEAD_EN_S  17

/* UHCI_SEPER_EN : RW; bitpos: [16]; default: 1;
 * Set this bit to use special char to separate the data frame.
 */

#define UHCI_SEPER_EN    (BIT(16))
#define UHCI_SEPER_EN_M  (UHCI_SEPER_EN_V << UHCI_SEPER_EN_S)
#define UHCI_SEPER_EN_V  0x00000001
#define UHCI_SEPER_EN_S  16

/* UHCI_MEM_TRANS_EN : RW; bitpos: [15]; default: 0; */

#define UHCI_MEM_TRANS_EN    (BIT(15))
#define UHCI_MEM_TRANS_EN_M  (UHCI_MEM_TRANS_EN_V << UHCI_MEM_TRANS_EN_S)
#define UHCI_MEM_TRANS_EN_V  0x00000001
#define UHCI_MEM_TRANS_EN_S  15

/* UHCI_OUT_DATA_BURST_EN : RW; bitpos: [14]; default: 0;
 * Set this bit to enable DMA burst MODE
 */

#define UHCI_OUT_DATA_BURST_EN    (BIT(14))
#define UHCI_OUT_DATA_BURST_EN_M  (UHCI_OUT_DATA_BURST_EN_V << UHCI_OUT_DATA_BURST_EN_S)
#define UHCI_OUT_DATA_BURST_EN_V  0x00000001
#define UHCI_OUT_DATA_BURST_EN_S  14

/* UHCI_INDSCR_BURST_EN : RW; bitpos: [13]; default: 0;
 * Set this bit to enable DMA out links to use burst mode.
 */

#define UHCI_INDSCR_BURST_EN    (BIT(13))
#define UHCI_INDSCR_BURST_EN_M  (UHCI_INDSCR_BURST_EN_V << UHCI_INDSCR_BURST_EN_S)
#define UHCI_INDSCR_BURST_EN_V  0x00000001
#define UHCI_INDSCR_BURST_EN_S  13

/* UHCI_OUTDSCR_BURST_EN : RW; bitpos: [12]; default: 0;
 * Set this bit to enable DMA in links to use burst mode.
 */

#define UHCI_OUTDSCR_BURST_EN    (BIT(12))
#define UHCI_OUTDSCR_BURST_EN_M  (UHCI_OUTDSCR_BURST_EN_V << UHCI_OUTDSCR_BURST_EN_S)
#define UHCI_OUTDSCR_BURST_EN_V  0x00000001
#define UHCI_OUTDSCR_BURST_EN_S  12

/* UHCI_UART2_CE : RW; bitpos: [11]; default: 0;
 * Set this bit to use UART2 to transmit or receive data.
 */

#define UHCI_UART2_CE    (BIT(11))
#define UHCI_UART2_CE_M  (UHCI_UART2_CE_V << UHCI_UART2_CE_S)
#define UHCI_UART2_CE_V  0x00000001
#define UHCI_UART2_CE_S  11

/* UHCI_UART1_CE : RW; bitpos: [10]; default: 0;
 * Set this bit to use UART1 to transmit or receive data.
 */

#define UHCI_UART1_CE    (BIT(10))
#define UHCI_UART1_CE_M  (UHCI_UART1_CE_V << UHCI_UART1_CE_S)
#define UHCI_UART1_CE_V  0x00000001
#define UHCI_UART1_CE_S  10

/* UHCI_UART0_CE : RW; bitpos: [9]; default: 0;
 * Set this bit to use UART to transmit or receive data.
 */

#define UHCI_UART0_CE    (BIT(9))
#define UHCI_UART0_CE_M  (UHCI_UART0_CE_V << UHCI_UART0_CE_S)
#define UHCI_UART0_CE_V  0x00000001
#define UHCI_UART0_CE_S  9

/* UHCI_OUT_EOF_MODE : RW; bitpos: [8]; default: 1;
 * Set this bit to produce eof after DMA pops all data  clear this bit to
 * produce eof after DMA pushes all data
 */

#define UHCI_OUT_EOF_MODE    (BIT(8))
#define UHCI_OUT_EOF_MODE_M  (UHCI_OUT_EOF_MODE_V << UHCI_OUT_EOF_MODE_S)
#define UHCI_OUT_EOF_MODE_V  0x00000001
#define UHCI_OUT_EOF_MODE_S  8

/* UHCI_OUT_NO_RESTART_CLR : RW; bitpos: [7]; default: 0;
 * don't use
 */

