apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_uhci.h
#define UHCI_OUT_NO_RESTART_CLR    (BIT(7))
#define UHCI_OUT_NO_RESTART_CLR_M  (UHCI_OUT_NO_RESTART_CLR_V << UHCI_OUT_NO_RESTART_CLR_S)
#define UHCI_OUT_NO_RESTART_CLR_V  0x00000001
#define UHCI_OUT_NO_RESTART_CLR_S  7

/* UHCI_OUT_AUTO_WRBACK : RW; bitpos: [6]; default: 0;
 * when in link's length is 0  go on to use the next in link automatically.
 */

#define UHCI_OUT_AUTO_WRBACK    (BIT(6))
#define UHCI_OUT_AUTO_WRBACK_M  (UHCI_OUT_AUTO_WRBACK_V << UHCI_OUT_AUTO_WRBACK_S)
#define UHCI_OUT_AUTO_WRBACK_V  0x00000001
#define UHCI_OUT_AUTO_WRBACK_S  6

/* UHCI_OUT_LOOP_TEST : RW; bitpos: [5]; default: 0;
 * Set this bit to enable loop test for out links.
 */

#define UHCI_OUT_LOOP_TEST    (BIT(5))
#define UHCI_OUT_LOOP_TEST_M  (UHCI_OUT_LOOP_TEST_V << UHCI_OUT_LOOP_TEST_S)
#define UHCI_OUT_LOOP_TEST_V  0x00000001
#define UHCI_OUT_LOOP_TEST_S  5

/* UHCI_IN_LOOP_TEST : RW; bitpos: [4]; default: 0;
 * Set this bit to enable loop test for in links.
 */

#define UHCI_IN_LOOP_TEST    (BIT(4))
#define UHCI_IN_LOOP_TEST_M  (UHCI_IN_LOOP_TEST_V << UHCI_IN_LOOP_TEST_S)
#define UHCI_IN_LOOP_TEST_V  0x00000001
#define UHCI_IN_LOOP_TEST_S  4

/* UHCI_AHBM_RST : RW; bitpos: [3]; default: 0;
 * Set this bit to reset dma  ahb interface.
 */

#define UHCI_AHBM_RST    (BIT(3))
#define UHCI_AHBM_RST_M  (UHCI_AHBM_RST_V << UHCI_AHBM_RST_S)
#define UHCI_AHBM_RST_V  0x00000001
#define UHCI_AHBM_RST_S  3

/* UHCI_AHBM_FIFO_RST : RW; bitpos: [2]; default: 0;
 * Set this bit to reset dma ahb fifo.
 */

#define UHCI_AHBM_FIFO_RST    (BIT(2))
#define UHCI_AHBM_FIFO_RST_M  (UHCI_AHBM_FIFO_RST_V << UHCI_AHBM_FIFO_RST_S)
#define UHCI_AHBM_FIFO_RST_V  0x00000001
#define UHCI_AHBM_FIFO_RST_S  2

/* UHCI_OUT_RST : RW; bitpos: [1]; default: 0;
 * Set this bit to reset out link operations.
 */

#define UHCI_OUT_RST    (BIT(1))
#define UHCI_OUT_RST_M  (UHCI_OUT_RST_V << UHCI_OUT_RST_S)
#define UHCI_OUT_RST_V  0x00000001
#define UHCI_OUT_RST_S  1

/* UHCI_IN_RST : RW; bitpos: [0]; default: 0;
 * Set this bit to reset in link operations.
 */

#define UHCI_IN_RST    (BIT(0))
#define UHCI_IN_RST_M  (UHCI_IN_RST_V << UHCI_IN_RST_S)
#define UHCI_IN_RST_V  0x00000001
#define UHCI_IN_RST_S  0

/* UHCI_INT_RAW_REG register */

#define UHCI_INT_RAW_REG(i) (REG_UHCI_BASE(i) + 0x4)

/* UHCI_DMA_INFIFO_FULL_WM_INT_RAW : R; bitpos: [16]; default: 0; */

#define UHCI_DMA_INFIFO_FULL_WM_INT_RAW    (BIT(16))
#define UHCI_DMA_INFIFO_FULL_WM_INT_RAW_M  (UHCI_DMA_INFIFO_FULL_WM_INT_RAW_V << UHCI_DMA_INFIFO_FULL_WM_INT_RAW_S)
#define UHCI_DMA_INFIFO_FULL_WM_INT_RAW_V  0x00000001
#define UHCI_DMA_INFIFO_FULL_WM_INT_RAW_S  16

/* UHCI_SEND_A_Q_INT_RAW : R; bitpos: [15]; default: 0;
 * When use always_send registers to send a series of short packets it will
 * produce this interrupt when dma has send the short packet.
 */

#define UHCI_SEND_A_Q_INT_RAW    (BIT(15))
#define UHCI_SEND_A_Q_INT_RAW_M  (UHCI_SEND_A_Q_INT_RAW_V << UHCI_SEND_A_Q_INT_RAW_S)
#define UHCI_SEND_A_Q_INT_RAW_V  0x00000001
#define UHCI_SEND_A_Q_INT_RAW_S  15

/* UHCI_SEND_S_Q_INT_RAW : R; bitpos: [14]; default: 0;
 * When use single send registers to send a short packets it will produce
 * this interrupt when dma has send the short packet.
 */

#define UHCI_SEND_S_Q_INT_RAW    (BIT(14))
#define UHCI_SEND_S_Q_INT_RAW_M  (UHCI_SEND_S_Q_INT_RAW_V << UHCI_SEND_S_Q_INT_RAW_S)
#define UHCI_SEND_S_Q_INT_RAW_V  0x00000001
#define UHCI_SEND_S_Q_INT_RAW_S  14

/* UHCI_OUT_TOTAL_EOF_INT_RAW : R; bitpos: [13]; default: 0;
 * When all data have been send  it will produce uhci_out_total_eof_int
 * interrupt.
 */

#define UHCI_OUT_TOTAL_EOF_INT_RAW    (BIT(13))
#define UHCI_OUT_TOTAL_EOF_INT_RAW_M  (UHCI_OUT_TOTAL_EOF_INT_RAW_V << UHCI_OUT_TOTAL_EOF_INT_RAW_S)
#define UHCI_OUT_TOTAL_EOF_INT_RAW_V  0x00000001
#define UHCI_OUT_TOTAL_EOF_INT_RAW_S  13

/* UHCI_OUTLINK_EOF_ERR_INT_RAW : R; bitpos: [12]; default: 0;
 * when there are some errors about eof in outlink descriptor  it will
 * produce uhci_outlink_eof_err_int interrupt.
 */

#define UHCI_OUTLINK_EOF_ERR_INT_RAW    (BIT(12))
#define UHCI_OUTLINK_EOF_ERR_INT_RAW_M  (UHCI_OUTLINK_EOF_ERR_INT_RAW_V << UHCI_OUTLINK_EOF_ERR_INT_RAW_S)
#define UHCI_OUTLINK_EOF_ERR_INT_RAW_V  0x00000001
#define UHCI_OUTLINK_EOF_ERR_INT_RAW_S  12

/* UHCI_IN_DSCR_EMPTY_INT_RAW : R; bitpos: [11]; default: 0;
 * when there are not enough in links for DMA it will produce
 * uhci_in_dscr_err_int interrupt.
 */

#define UHCI_IN_DSCR_EMPTY_INT_RAW    (BIT(11))
#define UHCI_IN_DSCR_EMPTY_INT_RAW_M  (UHCI_IN_DSCR_EMPTY_INT_RAW_V << UHCI_IN_DSCR_EMPTY_INT_RAW_S)
#define UHCI_IN_DSCR_EMPTY_INT_RAW_V  0x00000001
#define UHCI_IN_DSCR_EMPTY_INT_RAW_S  11

/* UHCI_OUT_DSCR_ERR_INT_RAW : R; bitpos: [10]; default: 0;
 * when there are some errors about the in link descriptor  it will produce
 * uhci_out_dscr_err_int interrupt.
 */

#define UHCI_OUT_DSCR_ERR_INT_RAW    (BIT(10))
#define UHCI_OUT_DSCR_ERR_INT_RAW_M  (UHCI_OUT_DSCR_ERR_INT_RAW_V << UHCI_OUT_DSCR_ERR_INT_RAW_S)
#define UHCI_OUT_DSCR_ERR_INT_RAW_V  0x00000001
#define UHCI_OUT_DSCR_ERR_INT_RAW_S  10

/* UHCI_IN_DSCR_ERR_INT_RAW : R; bitpos: [9]; default: 0;
 * when there are some errors about the out link descriptor  it will produce
 * uhci_in_dscr_err_int interrupt.
 */

#define UHCI_IN_DSCR_ERR_INT_RAW    (BIT(9))
#define UHCI_IN_DSCR_ERR_INT_RAW_M  (UHCI_IN_DSCR_ERR_INT_RAW_V << UHCI_IN_DSCR_ERR_INT_RAW_S)
#define UHCI_IN_DSCR_ERR_INT_RAW_V  0x00000001
#define UHCI_IN_DSCR_ERR_INT_RAW_S  9

/* UHCI_OUT_EOF_INT_RAW : R; bitpos: [8]; default: 0;
 * when the current descriptor's eof bit is 1  it will produce
 * uhci_out_eof_int interrupt.
 */

#define UHCI_OUT_EOF_INT_RAW    (BIT(8))
#define UHCI_OUT_EOF_INT_RAW_M  (UHCI_OUT_EOF_INT_RAW_V << UHCI_OUT_EOF_INT_RAW_S)
#define UHCI_OUT_EOF_INT_RAW_V  0x00000001
#define UHCI_OUT_EOF_INT_RAW_S  8

/* UHCI_OUT_DONE_INT_RAW : R; bitpos: [7]; default: 0;
 * when a out link descriptor is completed  it will produce
 * uhci_out_done_int interrupt.
 */

#define UHCI_OUT_DONE_INT_RAW    (BIT(7))
#define UHCI_OUT_DONE_INT_RAW_M  (UHCI_OUT_DONE_INT_RAW_V << UHCI_OUT_DONE_INT_RAW_S)
#define UHCI_OUT_DONE_INT_RAW_V  0x00000001
#define UHCI_OUT_DONE_INT_RAW_S  7

