apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_uhci.h
/* UHCI_IN_ERR_EOF_INT_RAW : R; bitpos: [6]; default: 0;
 * when there are some errors about eof in in link descriptor  it will
 * produce uhci_in_err_eof_int interrupt.
 */

#define UHCI_IN_ERR_EOF_INT_RAW    (BIT(6))
#define UHCI_IN_ERR_EOF_INT_RAW_M  (UHCI_IN_ERR_EOF_INT_RAW_V << UHCI_IN_ERR_EOF_INT_RAW_S)
#define UHCI_IN_ERR_EOF_INT_RAW_V  0x00000001
#define UHCI_IN_ERR_EOF_INT_RAW_S  6

/* UHCI_IN_SUC_EOF_INT_RAW : R; bitpos: [5]; default: 0;
 * when a data packet has been received  it will produce uhci_in_suc_eof_int
 * interrupt.
 */

#define UHCI_IN_SUC_EOF_INT_RAW    (BIT(5))
#define UHCI_IN_SUC_EOF_INT_RAW_M  (UHCI_IN_SUC_EOF_INT_RAW_V << UHCI_IN_SUC_EOF_INT_RAW_S)
#define UHCI_IN_SUC_EOF_INT_RAW_V  0x00000001
#define UHCI_IN_SUC_EOF_INT_RAW_S  5

/* UHCI_IN_DONE_INT_RAW : R; bitpos: [4]; default: 0;
 * when a in link descriptor has been completed it will produce
 * uhci_in_done_int interrupt.
 */

#define UHCI_IN_DONE_INT_RAW    (BIT(4))
#define UHCI_IN_DONE_INT_RAW_M  (UHCI_IN_DONE_INT_RAW_V << UHCI_IN_DONE_INT_RAW_S)
#define UHCI_IN_DONE_INT_RAW_V  0x00000001
#define UHCI_IN_DONE_INT_RAW_S  4

/* UHCI_TX_HUNG_INT_RAW : R; bitpos: [3]; default: 0;
 * when DMA takes a lot of time to read a data from RAM  it will produce
 * uhci_tx_hung_int interrupt.
 */

#define UHCI_TX_HUNG_INT_RAW    (BIT(3))
#define UHCI_TX_HUNG_INT_RAW_M  (UHCI_TX_HUNG_INT_RAW_V << UHCI_TX_HUNG_INT_RAW_S)
#define UHCI_TX_HUNG_INT_RAW_V  0x00000001
#define UHCI_TX_HUNG_INT_RAW_S  3

/* UHCI_RX_HUNG_INT_RAW : R; bitpos: [2]; default: 0;
 * when DMA takes a lot of time to receive a data   it will produce
 * uhci_rx_hung_int interrupt.
 */

#define UHCI_RX_HUNG_INT_RAW    (BIT(2))
#define UHCI_RX_HUNG_INT_RAW_M  (UHCI_RX_HUNG_INT_RAW_V << UHCI_RX_HUNG_INT_RAW_S)
#define UHCI_RX_HUNG_INT_RAW_V  0x00000001
#define UHCI_RX_HUNG_INT_RAW_S  2

/* UHCI_TX_START_INT_RAW : R; bitpos: [1]; default: 0;
 * when DMA detects a separator char it will produce uhci_tx_start_int
 * interrupt.
 */

#define UHCI_TX_START_INT_RAW    (BIT(1))
#define UHCI_TX_START_INT_RAW_M  (UHCI_TX_START_INT_RAW_V << UHCI_TX_START_INT_RAW_S)
#define UHCI_TX_START_INT_RAW_V  0x00000001
#define UHCI_TX_START_INT_RAW_S  1

/* UHCI_RX_START_INT_RAW : R; bitpos: [0]; default: 0;
 * when a separator char has been send  it will produce uhci_rx_start_int
 * interrupt.
 */

#define UHCI_RX_START_INT_RAW    (BIT(0))
#define UHCI_RX_START_INT_RAW_M  (UHCI_RX_START_INT_RAW_V << UHCI_RX_START_INT_RAW_S)
#define UHCI_RX_START_INT_RAW_V  0x00000001
#define UHCI_RX_START_INT_RAW_S  0

/* UHCI_INT_ST_REG register */

#define UHCI_INT_ST_REG(i) (REG_UHCI_BASE(i) + 0x8)

/* UHCI_DMA_INFIFO_FULL_WM_INT_ST : R; bitpos: [16]; default: 0; */

#define UHCI_DMA_INFIFO_FULL_WM_INT_ST    (BIT(16))
#define UHCI_DMA_INFIFO_FULL_WM_INT_ST_M  (UHCI_DMA_INFIFO_FULL_WM_INT_ST_V << UHCI_DMA_INFIFO_FULL_WM_INT_ST_S)
#define UHCI_DMA_INFIFO_FULL_WM_INT_ST_V  0x00000001
#define UHCI_DMA_INFIFO_FULL_WM_INT_ST_S  16

/* UHCI_SEND_A_Q_INT_ST : R; bitpos: [15]; default: 0; */

#define UHCI_SEND_A_Q_INT_ST    (BIT(15))
#define UHCI_SEND_A_Q_INT_ST_M  (UHCI_SEND_A_Q_INT_ST_V << UHCI_SEND_A_Q_INT_ST_S)
#define UHCI_SEND_A_Q_INT_ST_V  0x00000001
#define UHCI_SEND_A_Q_INT_ST_S  15

/* UHCI_SEND_S_Q_INT_ST : R; bitpos: [14]; default: 0; */

#define UHCI_SEND_S_Q_INT_ST    (BIT(14))
#define UHCI_SEND_S_Q_INT_ST_M  (UHCI_SEND_S_Q_INT_ST_V << UHCI_SEND_S_Q_INT_ST_S)
#define UHCI_SEND_S_Q_INT_ST_V  0x00000001
#define UHCI_SEND_S_Q_INT_ST_S  14

/* UHCI_OUT_TOTAL_EOF_INT_ST : R; bitpos: [13]; default: 0; */

#define UHCI_OUT_TOTAL_EOF_INT_ST    (BIT(13))
#define UHCI_OUT_TOTAL_EOF_INT_ST_M  (UHCI_OUT_TOTAL_EOF_INT_ST_V << UHCI_OUT_TOTAL_EOF_INT_ST_S)
#define UHCI_OUT_TOTAL_EOF_INT_ST_V  0x00000001
#define UHCI_OUT_TOTAL_EOF_INT_ST_S  13

/* UHCI_OUTLINK_EOF_ERR_INT_ST : R; bitpos: [12]; default: 0; */

#define UHCI_OUTLINK_EOF_ERR_INT_ST    (BIT(12))
#define UHCI_OUTLINK_EOF_ERR_INT_ST_M  (UHCI_OUTLINK_EOF_ERR_INT_ST_V << UHCI_OUTLINK_EOF_ERR_INT_ST_S)
#define UHCI_OUTLINK_EOF_ERR_INT_ST_V  0x00000001
#define UHCI_OUTLINK_EOF_ERR_INT_ST_S  12

/* UHCI_IN_DSCR_EMPTY_INT_ST : R; bitpos: [11]; default: 0; */

#define UHCI_IN_DSCR_EMPTY_INT_ST    (BIT(11))
#define UHCI_IN_DSCR_EMPTY_INT_ST_M  (UHCI_IN_DSCR_EMPTY_INT_ST_V << UHCI_IN_DSCR_EMPTY_INT_ST_S)
#define UHCI_IN_DSCR_EMPTY_INT_ST_V  0x00000001
#define UHCI_IN_DSCR_EMPTY_INT_ST_S  11

/* UHCI_OUT_DSCR_ERR_INT_ST : R; bitpos: [10]; default: 0; */

#define UHCI_OUT_DSCR_ERR_INT_ST    (BIT(10))
#define UHCI_OUT_DSCR_ERR_INT_ST_M  (UHCI_OUT_DSCR_ERR_INT_ST_V << UHCI_OUT_DSCR_ERR_INT_ST_S)
#define UHCI_OUT_DSCR_ERR_INT_ST_V  0x00000001
#define UHCI_OUT_DSCR_ERR_INT_ST_S  10

/* UHCI_IN_DSCR_ERR_INT_ST : R; bitpos: [9]; default: 0; */

#define UHCI_IN_DSCR_ERR_INT_ST    (BIT(9))
#define UHCI_IN_DSCR_ERR_INT_ST_M  (UHCI_IN_DSCR_ERR_INT_ST_V << UHCI_IN_DSCR_ERR_INT_ST_S)
#define UHCI_IN_DSCR_ERR_INT_ST_V  0x00000001
#define UHCI_IN_DSCR_ERR_INT_ST_S  9

/* UHCI_OUT_EOF_INT_ST : R; bitpos: [8]; default: 0; */

#define UHCI_OUT_EOF_INT_ST    (BIT(8))
#define UHCI_OUT_EOF_INT_ST_M  (UHCI_OUT_EOF_INT_ST_V << UHCI_OUT_EOF_INT_ST_S)
#define UHCI_OUT_EOF_INT_ST_V  0x00000001
#define UHCI_OUT_EOF_INT_ST_S  8

/* UHCI_OUT_DONE_INT_ST : R; bitpos: [7]; default: 0; */

#define UHCI_OUT_DONE_INT_ST    (BIT(7))
#define UHCI_OUT_DONE_INT_ST_M  (UHCI_OUT_DONE_INT_ST_V << UHCI_OUT_DONE_INT_ST_S)
#define UHCI_OUT_DONE_INT_ST_V  0x00000001
#define UHCI_OUT_DONE_INT_ST_S  7

/* UHCI_IN_ERR_EOF_INT_ST : R; bitpos: [6]; default: 0; */

#define UHCI_IN_ERR_EOF_INT_ST    (BIT(6))
#define UHCI_IN_ERR_EOF_INT_ST_M  (UHCI_IN_ERR_EOF_INT_ST_V << UHCI_IN_ERR_EOF_INT_ST_S)
#define UHCI_IN_ERR_EOF_INT_ST_V  0x00000001
#define UHCI_IN_ERR_EOF_INT_ST_S  6

/* UHCI_IN_SUC_EOF_INT_ST : R; bitpos: [5]; default: 0; */

#define UHCI_IN_SUC_EOF_INT_ST    (BIT(5))
#define UHCI_IN_SUC_EOF_INT_ST_M  (UHCI_IN_SUC_EOF_INT_ST_V << UHCI_IN_SUC_EOF_INT_ST_S)
#define UHCI_IN_SUC_EOF_INT_ST_V  0x00000001
#define UHCI_IN_SUC_EOF_INT_ST_S  5

