apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_uhci.h
/* UHCI_IN_DONE_INT_ST : R; bitpos: [4]; default: 0; */

#define UHCI_IN_DONE_INT_ST    (BIT(4))
#define UHCI_IN_DONE_INT_ST_M  (UHCI_IN_DONE_INT_ST_V << UHCI_IN_DONE_INT_ST_S)
#define UHCI_IN_DONE_INT_ST_V  0x00000001
#define UHCI_IN_DONE_INT_ST_S  4

/* UHCI_TX_HUNG_INT_ST : R; bitpos: [3]; default: 0; */

#define UHCI_TX_HUNG_INT_ST    (BIT(3))
#define UHCI_TX_HUNG_INT_ST_M  (UHCI_TX_HUNG_INT_ST_V << UHCI_TX_HUNG_INT_ST_S)
#define UHCI_TX_HUNG_INT_ST_V  0x00000001
#define UHCI_TX_HUNG_INT_ST_S  3

/* UHCI_RX_HUNG_INT_ST : R; bitpos: [2]; default: 0; */

#define UHCI_RX_HUNG_INT_ST    (BIT(2))
#define UHCI_RX_HUNG_INT_ST_M  (UHCI_RX_HUNG_INT_ST_V << UHCI_RX_HUNG_INT_ST_S)
#define UHCI_RX_HUNG_INT_ST_V  0x00000001
#define UHCI_RX_HUNG_INT_ST_S  2

/* UHCI_TX_START_INT_ST : R; bitpos: [1]; default: 0; */

#define UHCI_TX_START_INT_ST    (BIT(1))
#define UHCI_TX_START_INT_ST_M  (UHCI_TX_START_INT_ST_V << UHCI_TX_START_INT_ST_S)
#define UHCI_TX_START_INT_ST_V  0x00000001
#define UHCI_TX_START_INT_ST_S  1

/* UHCI_RX_START_INT_ST : R; bitpos: [0]; default: 0; */

#define UHCI_RX_START_INT_ST    (BIT(0))
#define UHCI_RX_START_INT_ST_M  (UHCI_RX_START_INT_ST_V << UHCI_RX_START_INT_ST_S)
#define UHCI_RX_START_INT_ST_V  0x00000001
#define UHCI_RX_START_INT_ST_S  0

/* UHCI_INT_ENA_REG register */

#define UHCI_INT_ENA_REG(i) (REG_UHCI_BASE(i) + 0xc)

/* UHCI_DMA_INFIFO_FULL_WM_INT_ENA : RW; bitpos: [16]; default: 0; */

#define UHCI_DMA_INFIFO_FULL_WM_INT_ENA    (BIT(16))
#define UHCI_DMA_INFIFO_FULL_WM_INT_ENA_M  (UHCI_DMA_INFIFO_FULL_WM_INT_ENA_V << UHCI_DMA_INFIFO_FULL_WM_INT_ENA_S)
#define UHCI_DMA_INFIFO_FULL_WM_INT_ENA_V  0x00000001
#define UHCI_DMA_INFIFO_FULL_WM_INT_ENA_S  16

/* UHCI_SEND_A_Q_INT_ENA : RW; bitpos: [15]; default: 0; */

#define UHCI_SEND_A_Q_INT_ENA    (BIT(15))
#define UHCI_SEND_A_Q_INT_ENA_M  (UHCI_SEND_A_Q_INT_ENA_V << UHCI_SEND_A_Q_INT_ENA_S)
#define UHCI_SEND_A_Q_INT_ENA_V  0x00000001
#define UHCI_SEND_A_Q_INT_ENA_S  15

/* UHCI_SEND_S_Q_INT_ENA : RW; bitpos: [14]; default: 0; */

#define UHCI_SEND_S_Q_INT_ENA    (BIT(14))
#define UHCI_SEND_S_Q_INT_ENA_M  (UHCI_SEND_S_Q_INT_ENA_V << UHCI_SEND_S_Q_INT_ENA_S)
#define UHCI_SEND_S_Q_INT_ENA_V  0x00000001
#define UHCI_SEND_S_Q_INT_ENA_S  14

/* UHCI_OUT_TOTAL_EOF_INT_ENA : RW; bitpos: [13]; default: 0; */

#define UHCI_OUT_TOTAL_EOF_INT_ENA    (BIT(13))
#define UHCI_OUT_TOTAL_EOF_INT_ENA_M  (UHCI_OUT_TOTAL_EOF_INT_ENA_V << UHCI_OUT_TOTAL_EOF_INT_ENA_S)
#define UHCI_OUT_TOTAL_EOF_INT_ENA_V  0x00000001
#define UHCI_OUT_TOTAL_EOF_INT_ENA_S  13

/* UHCI_OUTLINK_EOF_ERR_INT_ENA : RW; bitpos: [12]; default: 0; */

#define UHCI_OUTLINK_EOF_ERR_INT_ENA    (BIT(12))
#define UHCI_OUTLINK_EOF_ERR_INT_ENA_M  (UHCI_OUTLINK_EOF_ERR_INT_ENA_V << UHCI_OUTLINK_EOF_ERR_INT_ENA_S)
#define UHCI_OUTLINK_EOF_ERR_INT_ENA_V  0x00000001
#define UHCI_OUTLINK_EOF_ERR_INT_ENA_S  12

/* UHCI_IN_DSCR_EMPTY_INT_ENA : RW; bitpos: [11]; default: 0; */

#define UHCI_IN_DSCR_EMPTY_INT_ENA    (BIT(11))
#define UHCI_IN_DSCR_EMPTY_INT_ENA_M  (UHCI_IN_DSCR_EMPTY_INT_ENA_V << UHCI_IN_DSCR_EMPTY_INT_ENA_S)
#define UHCI_IN_DSCR_EMPTY_INT_ENA_V  0x00000001
#define UHCI_IN_DSCR_EMPTY_INT_ENA_S  11

/* UHCI_OUT_DSCR_ERR_INT_ENA : RW; bitpos: [10]; default: 0; */

#define UHCI_OUT_DSCR_ERR_INT_ENA    (BIT(10))
#define UHCI_OUT_DSCR_ERR_INT_ENA_M  (UHCI_OUT_DSCR_ERR_INT_ENA_V << UHCI_OUT_DSCR_ERR_INT_ENA_S)
#define UHCI_OUT_DSCR_ERR_INT_ENA_V  0x00000001
#define UHCI_OUT_DSCR_ERR_INT_ENA_S  10

/* UHCI_IN_DSCR_ERR_INT_ENA : RW; bitpos: [9]; default: 0; */

#define UHCI_IN_DSCR_ERR_INT_ENA    (BIT(9))
#define UHCI_IN_DSCR_ERR_INT_ENA_M  (UHCI_IN_DSCR_ERR_INT_ENA_V << UHCI_IN_DSCR_ERR_INT_ENA_S)
#define UHCI_IN_DSCR_ERR_INT_ENA_V  0x00000001
#define UHCI_IN_DSCR_ERR_INT_ENA_S  9

/* UHCI_OUT_EOF_INT_ENA : RW; bitpos: [8]; default: 0; */

#define UHCI_OUT_EOF_INT_ENA    (BIT(8))
#define UHCI_OUT_EOF_INT_ENA_M  (UHCI_OUT_EOF_INT_ENA_V << UHCI_OUT_EOF_INT_ENA_S)
#define UHCI_OUT_EOF_INT_ENA_V  0x00000001
#define UHCI_OUT_EOF_INT_ENA_S  8

/* UHCI_OUT_DONE_INT_ENA : RW; bitpos: [7]; default: 0; */

#define UHCI_OUT_DONE_INT_ENA    (BIT(7))
#define UHCI_OUT_DONE_INT_ENA_M  (UHCI_OUT_DONE_INT_ENA_V << UHCI_OUT_DONE_INT_ENA_S)
#define UHCI_OUT_DONE_INT_ENA_V  0x00000001
#define UHCI_OUT_DONE_INT_ENA_S  7

/* UHCI_IN_ERR_EOF_INT_ENA : RW; bitpos: [6]; default: 0; */

#define UHCI_IN_ERR_EOF_INT_ENA    (BIT(6))
#define UHCI_IN_ERR_EOF_INT_ENA_M  (UHCI_IN_ERR_EOF_INT_ENA_V << UHCI_IN_ERR_EOF_INT_ENA_S)
#define UHCI_IN_ERR_EOF_INT_ENA_V  0x00000001
#define UHCI_IN_ERR_EOF_INT_ENA_S  6

/* UHCI_IN_SUC_EOF_INT_ENA : RW; bitpos: [5]; default: 0; */

#define UHCI_IN_SUC_EOF_INT_ENA    (BIT(5))
#define UHCI_IN_SUC_EOF_INT_ENA_M  (UHCI_IN_SUC_EOF_INT_ENA_V << UHCI_IN_SUC_EOF_INT_ENA_S)
#define UHCI_IN_SUC_EOF_INT_ENA_V  0x00000001
#define UHCI_IN_SUC_EOF_INT_ENA_S  5

/* UHCI_IN_DONE_INT_ENA : RW; bitpos: [4]; default: 0; */

#define UHCI_IN_DONE_INT_ENA    (BIT(4))
#define UHCI_IN_DONE_INT_ENA_M  (UHCI_IN_DONE_INT_ENA_V << UHCI_IN_DONE_INT_ENA_S)
#define UHCI_IN_DONE_INT_ENA_V  0x00000001
#define UHCI_IN_DONE_INT_ENA_S  4

/* UHCI_TX_HUNG_INT_ENA : RW; bitpos: [3]; default: 0; */

#define UHCI_TX_HUNG_INT_ENA    (BIT(3))
#define UHCI_TX_HUNG_INT_ENA_M  (UHCI_TX_HUNG_INT_ENA_V << UHCI_TX_HUNG_INT_ENA_S)
#define UHCI_TX_HUNG_INT_ENA_V  0x00000001
#define UHCI_TX_HUNG_INT_ENA_S  3

/* UHCI_RX_HUNG_INT_ENA : RW; bitpos: [2]; default: 0; */

#define UHCI_RX_HUNG_INT_ENA    (BIT(2))
#define UHCI_RX_HUNG_INT_ENA_M  (UHCI_RX_HUNG_INT_ENA_V << UHCI_RX_HUNG_INT_ENA_S)
#define UHCI_RX_HUNG_INT_ENA_V  0x00000001
#define UHCI_RX_HUNG_INT_ENA_S  2

/* UHCI_TX_START_INT_ENA : RW; bitpos: [1]; default: 0; */

#define UHCI_TX_START_INT_ENA    (BIT(1))
#define UHCI_TX_START_INT_ENA_M  (UHCI_TX_START_INT_ENA_V << UHCI_TX_START_INT_ENA_S)
#define UHCI_TX_START_INT_ENA_V  0x00000001
#define UHCI_TX_START_INT_ENA_S  1

/* UHCI_RX_START_INT_ENA : RW; bitpos: [0]; default: 0; */

#define UHCI_RX_START_INT_ENA    (BIT(0))
#define UHCI_RX_START_INT_ENA_M  (UHCI_RX_START_INT_ENA_V << UHCI_RX_START_INT_ENA_S)
#define UHCI_RX_START_INT_ENA_V  0x00000001
#define UHCI_RX_START_INT_ENA_S  0

/* UHCI_INT_CLR_REG register */

#define UHCI_INT_CLR_REG(i) (REG_UHCI_BASE(i) + 0x10)

