apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_uhci.h
/* UHCI_DMA_INFIFO_FULL_WM_INT_CLR : W; bitpos: [16]; default: 0; */

#define UHCI_DMA_INFIFO_FULL_WM_INT_CLR    (BIT(16))
#define UHCI_DMA_INFIFO_FULL_WM_INT_CLR_M  (UHCI_DMA_INFIFO_FULL_WM_INT_CLR_V << UHCI_DMA_INFIFO_FULL_WM_INT_CLR_S)
#define UHCI_DMA_INFIFO_FULL_WM_INT_CLR_V  0x00000001
#define UHCI_DMA_INFIFO_FULL_WM_INT_CLR_S  16

/* UHCI_SEND_A_Q_INT_CLR : W; bitpos: [15]; default: 0; */

#define UHCI_SEND_A_Q_INT_CLR    (BIT(15))
#define UHCI_SEND_A_Q_INT_CLR_M  (UHCI_SEND_A_Q_INT_CLR_V << UHCI_SEND_A_Q_INT_CLR_S)
#define UHCI_SEND_A_Q_INT_CLR_V  0x00000001
#define UHCI_SEND_A_Q_INT_CLR_S  15

/* UHCI_SEND_S_Q_INT_CLR : W; bitpos: [14]; default: 0; */

#define UHCI_SEND_S_Q_INT_CLR    (BIT(14))
#define UHCI_SEND_S_Q_INT_CLR_M  (UHCI_SEND_S_Q_INT_CLR_V << UHCI_SEND_S_Q_INT_CLR_S)
#define UHCI_SEND_S_Q_INT_CLR_V  0x00000001
#define UHCI_SEND_S_Q_INT_CLR_S  14

/* UHCI_OUT_TOTAL_EOF_INT_CLR : W; bitpos: [13]; default: 0; */

#define UHCI_OUT_TOTAL_EOF_INT_CLR    (BIT(13))
#define UHCI_OUT_TOTAL_EOF_INT_CLR_M  (UHCI_OUT_TOTAL_EOF_INT_CLR_V << UHCI_OUT_TOTAL_EOF_INT_CLR_S)
#define UHCI_OUT_TOTAL_EOF_INT_CLR_V  0x00000001
#define UHCI_OUT_TOTAL_EOF_INT_CLR_S  13

/* UHCI_OUTLINK_EOF_ERR_INT_CLR : W; bitpos: [12]; default: 0; */

#define UHCI_OUTLINK_EOF_ERR_INT_CLR    (BIT(12))
#define UHCI_OUTLINK_EOF_ERR_INT_CLR_M  (UHCI_OUTLINK_EOF_ERR_INT_CLR_V << UHCI_OUTLINK_EOF_ERR_INT_CLR_S)
#define UHCI_OUTLINK_EOF_ERR_INT_CLR_V  0x00000001
#define UHCI_OUTLINK_EOF_ERR_INT_CLR_S  12

/* UHCI_IN_DSCR_EMPTY_INT_CLR : W; bitpos: [11]; default: 0; */

#define UHCI_IN_DSCR_EMPTY_INT_CLR    (BIT(11))
#define UHCI_IN_DSCR_EMPTY_INT_CLR_M  (UHCI_IN_DSCR_EMPTY_INT_CLR_V << UHCI_IN_DSCR_EMPTY_INT_CLR_S)
#define UHCI_IN_DSCR_EMPTY_INT_CLR_V  0x00000001
#define UHCI_IN_DSCR_EMPTY_INT_CLR_S  11

/* UHCI_OUT_DSCR_ERR_INT_CLR : W; bitpos: [10]; default: 0; */

#define UHCI_OUT_DSCR_ERR_INT_CLR    (BIT(10))
#define UHCI_OUT_DSCR_ERR_INT_CLR_M  (UHCI_OUT_DSCR_ERR_INT_CLR_V << UHCI_OUT_DSCR_ERR_INT_CLR_S)
#define UHCI_OUT_DSCR_ERR_INT_CLR_V  0x00000001
#define UHCI_OUT_DSCR_ERR_INT_CLR_S  10

/* UHCI_IN_DSCR_ERR_INT_CLR : W; bitpos: [9]; default: 0; */

#define UHCI_IN_DSCR_ERR_INT_CLR    (BIT(9))
#define UHCI_IN_DSCR_ERR_INT_CLR_M  (UHCI_IN_DSCR_ERR_INT_CLR_V << UHCI_IN_DSCR_ERR_INT_CLR_S)
#define UHCI_IN_DSCR_ERR_INT_CLR_V  0x00000001
#define UHCI_IN_DSCR_ERR_INT_CLR_S  9

/* UHCI_OUT_EOF_INT_CLR : W; bitpos: [8]; default: 0; */

#define UHCI_OUT_EOF_INT_CLR    (BIT(8))
#define UHCI_OUT_EOF_INT_CLR_M  (UHCI_OUT_EOF_INT_CLR_V << UHCI_OUT_EOF_INT_CLR_S)
#define UHCI_OUT_EOF_INT_CLR_V  0x00000001
#define UHCI_OUT_EOF_INT_CLR_S  8

/* UHCI_OUT_DONE_INT_CLR : W; bitpos: [7]; default: 0; */

#define UHCI_OUT_DONE_INT_CLR    (BIT(7))
#define UHCI_OUT_DONE_INT_CLR_M  (UHCI_OUT_DONE_INT_CLR_V << UHCI_OUT_DONE_INT_CLR_S)
#define UHCI_OUT_DONE_INT_CLR_V  0x00000001
#define UHCI_OUT_DONE_INT_CLR_S  7

/* UHCI_IN_ERR_EOF_INT_CLR : W; bitpos: [6]; default: 0; */

#define UHCI_IN_ERR_EOF_INT_CLR    (BIT(6))
#define UHCI_IN_ERR_EOF_INT_CLR_M  (UHCI_IN_ERR_EOF_INT_CLR_V << UHCI_IN_ERR_EOF_INT_CLR_S)
#define UHCI_IN_ERR_EOF_INT_CLR_V  0x00000001
#define UHCI_IN_ERR_EOF_INT_CLR_S  6

/* UHCI_IN_SUC_EOF_INT_CLR : W; bitpos: [5]; default: 0; */

#define UHCI_IN_SUC_EOF_INT_CLR    (BIT(5))
#define UHCI_IN_SUC_EOF_INT_CLR_M  (UHCI_IN_SUC_EOF_INT_CLR_V << UHCI_IN_SUC_EOF_INT_CLR_S)
#define UHCI_IN_SUC_EOF_INT_CLR_V  0x00000001
#define UHCI_IN_SUC_EOF_INT_CLR_S  5

/* UHCI_IN_DONE_INT_CLR : W; bitpos: [4]; default: 0; */

#define UHCI_IN_DONE_INT_CLR    (BIT(4))
#define UHCI_IN_DONE_INT_CLR_M  (UHCI_IN_DONE_INT_CLR_V << UHCI_IN_DONE_INT_CLR_S)
#define UHCI_IN_DONE_INT_CLR_V  0x00000001
#define UHCI_IN_DONE_INT_CLR_S  4

/* UHCI_TX_HUNG_INT_CLR : W; bitpos: [3]; default: 0; */

#define UHCI_TX_HUNG_INT_CLR    (BIT(3))
#define UHCI_TX_HUNG_INT_CLR_M  (UHCI_TX_HUNG_INT_CLR_V << UHCI_TX_HUNG_INT_CLR_S)
#define UHCI_TX_HUNG_INT_CLR_V  0x00000001
#define UHCI_TX_HUNG_INT_CLR_S  3

/* UHCI_RX_HUNG_INT_CLR : W; bitpos: [2]; default: 0; */

#define UHCI_RX_HUNG_INT_CLR    (BIT(2))
#define UHCI_RX_HUNG_INT_CLR_M  (UHCI_RX_HUNG_INT_CLR_V << UHCI_RX_HUNG_INT_CLR_S)
#define UHCI_RX_HUNG_INT_CLR_V  0x00000001
#define UHCI_RX_HUNG_INT_CLR_S  2

/* UHCI_TX_START_INT_CLR : W; bitpos: [1]; default: 0; */

#define UHCI_TX_START_INT_CLR    (BIT(1))
#define UHCI_TX_START_INT_CLR_M  (UHCI_TX_START_INT_CLR_V << UHCI_TX_START_INT_CLR_S)
#define UHCI_TX_START_INT_CLR_V  0x00000001
#define UHCI_TX_START_INT_CLR_S  1

/* UHCI_RX_START_INT_CLR : W; bitpos: [0]; default: 0; */

#define UHCI_RX_START_INT_CLR    (BIT(0))
#define UHCI_RX_START_INT_CLR_M  (UHCI_RX_START_INT_CLR_V << UHCI_RX_START_INT_CLR_S)
#define UHCI_RX_START_INT_CLR_V  0x00000001
#define UHCI_RX_START_INT_CLR_S  0

/* UHCI_DMA_OUT_STATUS_REG register */

#define UHCI_DMA_OUT_STATUS_REG(i) (REG_UHCI_BASE(i) + 0x14)

/* UHCI_OUT_EMPTY : R; bitpos: [1]; default: 1;
 * 1:DMA in link descriptor's fifo is empty.
 */

#define UHCI_OUT_EMPTY    (BIT(1))
#define UHCI_OUT_EMPTY_M  (UHCI_OUT_EMPTY_V << UHCI_OUT_EMPTY_S)
#define UHCI_OUT_EMPTY_V  0x00000001
#define UHCI_OUT_EMPTY_S  1

/* UHCI_OUT_FULL : R; bitpos: [0]; default: 0;
 * 1:DMA out link descriptor's fifo is full.
 */

#define UHCI_OUT_FULL    (BIT(0))
#define UHCI_OUT_FULL_M  (UHCI_OUT_FULL_V << UHCI_OUT_FULL_S)
#define UHCI_OUT_FULL_V  0x00000001
#define UHCI_OUT_FULL_S  0

/* UHCI_DMA_OUT_PUSH_REG register */

#define UHCI_DMA_OUT_PUSH_REG(i) (REG_UHCI_BASE(i) + 0x18)

/* UHCI_OUTFIFO_PUSH : RW; bitpos: [16]; default: 0;
 * Set this bit to push data in out link descriptor's fifo.
 */

#define UHCI_OUTFIFO_PUSH    (BIT(16))
#define UHCI_OUTFIFO_PUSH_M  (UHCI_OUTFIFO_PUSH_V << UHCI_OUTFIFO_PUSH_S)
#define UHCI_OUTFIFO_PUSH_V  0x00000001
#define UHCI_OUTFIFO_PUSH_S  16

/* UHCI_OUTFIFO_WDATA : RW; bitpos: [8:0]; default: 0;
 * This is the data need to be pushed into out link descriptor's fifo.
 */

#define UHCI_OUTFIFO_WDATA    0x000001FF
#define UHCI_OUTFIFO_WDATA_M  (UHCI_OUTFIFO_WDATA_V << UHCI_OUTFIFO_WDATA_S)
#define UHCI_OUTFIFO_WDATA_V  0x000001FF
#define UHCI_OUTFIFO_WDATA_S  0

/* UHCI_DMA_IN_STATUS_REG register */

