apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_uhci.h
#define UHCI_DMA_IN_STATUS_REG(i) (REG_UHCI_BASE(i) + 0x1c)

/* UHCI_RX_ERR_CAUSE : R; bitpos: [6:4]; default: 0;
 * This register stores the errors caused in out link descriptor's data
 * packet.
 */

#define UHCI_RX_ERR_CAUSE    0x00000007
#define UHCI_RX_ERR_CAUSE_M  (UHCI_RX_ERR_CAUSE_V << UHCI_RX_ERR_CAUSE_S)
#define UHCI_RX_ERR_CAUSE_V  0x00000007
#define UHCI_RX_ERR_CAUSE_S  4

/* UHCI_IN_EMPTY : R; bitpos: [1]; default: 1; */

#define UHCI_IN_EMPTY    (BIT(1))
#define UHCI_IN_EMPTY_M  (UHCI_IN_EMPTY_V << UHCI_IN_EMPTY_S)
#define UHCI_IN_EMPTY_V  0x00000001
#define UHCI_IN_EMPTY_S  1

/* UHCI_IN_FULL : R; bitpos: [0]; default: 0; */

#define UHCI_IN_FULL    (BIT(0))
#define UHCI_IN_FULL_M  (UHCI_IN_FULL_V << UHCI_IN_FULL_S)
#define UHCI_IN_FULL_V  0x00000001
#define UHCI_IN_FULL_S  0

/* UHCI_DMA_IN_POP_REG register */

#define UHCI_DMA_IN_POP_REG(i) (REG_UHCI_BASE(i) + 0x20)

/* UHCI_INFIFO_POP : RW; bitpos: [16]; default: 0;
 * Set this bit to pop data in in link descriptor's fifo.
 */

#define UHCI_INFIFO_POP    (BIT(16))
#define UHCI_INFIFO_POP_M  (UHCI_INFIFO_POP_V << UHCI_INFIFO_POP_S)
#define UHCI_INFIFO_POP_V  0x00000001
#define UHCI_INFIFO_POP_S  16

/* UHCI_INFIFO_RDATA : R; bitpos: [11:0]; default: 0;
 * This register stores the data pop from in link descriptor's fifo.
 */

#define UHCI_INFIFO_RDATA    0x00000FFF
#define UHCI_INFIFO_RDATA_M  (UHCI_INFIFO_RDATA_V << UHCI_INFIFO_RDATA_S)
#define UHCI_INFIFO_RDATA_V  0x00000FFF
#define UHCI_INFIFO_RDATA_S  0

/* UHCI_DMA_OUT_LINK_REG register */

#define UHCI_DMA_OUT_LINK_REG(i) (REG_UHCI_BASE(i) + 0x24)

/* UHCI_OUTLINK_PARK : R; bitpos: [31]; default: 0;
 * 1£º the out link descriptor's fsm is in idle state. 0:the out link
 * descriptor's fsm is working.
 */

#define UHCI_OUTLINK_PARK    (BIT(31))
#define UHCI_OUTLINK_PARK_M  (UHCI_OUTLINK_PARK_V << UHCI_OUTLINK_PARK_S)
#define UHCI_OUTLINK_PARK_V  0x00000001
#define UHCI_OUTLINK_PARK_S  31

/* UHCI_OUTLINK_RESTART : RW; bitpos: [30]; default: 0;
 * Set this bit to mount on new out link descriptors
 */

#define UHCI_OUTLINK_RESTART    (BIT(30))
#define UHCI_OUTLINK_RESTART_M  (UHCI_OUTLINK_RESTART_V << UHCI_OUTLINK_RESTART_S)
#define UHCI_OUTLINK_RESTART_V  0x00000001
#define UHCI_OUTLINK_RESTART_S  30

/* UHCI_OUTLINK_START : RW; bitpos: [29]; default: 0;
 * Set this bit to start dealing with the out link descriptors.
 */

#define UHCI_OUTLINK_START    (BIT(29))
#define UHCI_OUTLINK_START_M  (UHCI_OUTLINK_START_V << UHCI_OUTLINK_START_S)
#define UHCI_OUTLINK_START_V  0x00000001
#define UHCI_OUTLINK_START_S  29

/* UHCI_OUTLINK_STOP : RW; bitpos: [28]; default: 0;
 * Set this bit to stop dealing with the out link descriptors.
 */

#define UHCI_OUTLINK_STOP    (BIT(28))
#define UHCI_OUTLINK_STOP_M  (UHCI_OUTLINK_STOP_V << UHCI_OUTLINK_STOP_S)
#define UHCI_OUTLINK_STOP_V  0x00000001
#define UHCI_OUTLINK_STOP_S  28

/* UHCI_OUTLINK_ADDR : RW; bitpos: [19:0]; default: 0;
 * This register stores the least 20 bits of the first out link descriptor's
 * address.
 */

#define UHCI_OUTLINK_ADDR    0x000FFFFF
#define UHCI_OUTLINK_ADDR_M  (UHCI_OUTLINK_ADDR_V << UHCI_OUTLINK_ADDR_S)
#define UHCI_OUTLINK_ADDR_V  0x000FFFFF
#define UHCI_OUTLINK_ADDR_S  0

/* UHCI_DMA_IN_LINK_REG register */

#define UHCI_DMA_IN_LINK_REG(i) (REG_UHCI_BASE(i) + 0x28)

/* UHCI_INLINK_PARK : R; bitpos: [31]; default: 0;
 * 1:the in link descriptor's fsm is in idle state.   0:the in link
 * descriptor's fsm is working
 */

#define UHCI_INLINK_PARK    (BIT(31))
#define UHCI_INLINK_PARK_M  (UHCI_INLINK_PARK_V << UHCI_INLINK_PARK_S)
#define UHCI_INLINK_PARK_V  0x00000001
#define UHCI_INLINK_PARK_S  31

/* UHCI_INLINK_RESTART : RW; bitpos: [30]; default: 0;
 * Set this bit to mount on new in link descriptors
 */

#define UHCI_INLINK_RESTART    (BIT(30))
#define UHCI_INLINK_RESTART_M  (UHCI_INLINK_RESTART_V << UHCI_INLINK_RESTART_S)
#define UHCI_INLINK_RESTART_V  0x00000001
#define UHCI_INLINK_RESTART_S  30

/* UHCI_INLINK_START : RW; bitpos: [29]; default: 0;
 * Set this bit to start dealing with the in link descriptors.
 */

#define UHCI_INLINK_START    (BIT(29))
#define UHCI_INLINK_START_M  (UHCI_INLINK_START_V << UHCI_INLINK_START_S)
#define UHCI_INLINK_START_V  0x00000001
#define UHCI_INLINK_START_S  29

/* UHCI_INLINK_STOP : RW; bitpos: [28]; default: 0;
 * Set this bit to stop dealing with the in link descriptors.
 */

#define UHCI_INLINK_STOP    (BIT(28))
#define UHCI_INLINK_STOP_M  (UHCI_INLINK_STOP_V << UHCI_INLINK_STOP_S)
#define UHCI_INLINK_STOP_V  0x00000001
#define UHCI_INLINK_STOP_S  28

/* UHCI_INLINK_AUTO_RET : RW; bitpos: [20]; default: 1;
 * 1:when a packet is wrong in link descriptor returns to the descriptor
 * which is lately used.
 */

#define UHCI_INLINK_AUTO_RET    (BIT(20))
#define UHCI_INLINK_AUTO_RET_M  (UHCI_INLINK_AUTO_RET_V << UHCI_INLINK_AUTO_RET_S)
#define UHCI_INLINK_AUTO_RET_V  0x00000001
#define UHCI_INLINK_AUTO_RET_S  20

/* UHCI_INLINK_ADDR : RW; bitpos: [19:0]; default: 0;
 * This register stores the least 20 bits of the first in link descriptor's
 * address.
 */

#define UHCI_INLINK_ADDR    0x000FFFFF
#define UHCI_INLINK_ADDR_M  (UHCI_INLINK_ADDR_V << UHCI_INLINK_ADDR_S)
#define UHCI_INLINK_ADDR_V  0x000FFFFF
#define UHCI_INLINK_ADDR_S  0

/* UHCI_CONF1_REG register */

#define UHCI_CONF1_REG(i) (REG_UHCI_BASE(i) + 0x2c)

/* UHCI_DMA_INFIFO_FULL_THRS : RW; bitpos: [20:9]; default: 0;
 * when data amount in link descriptor's fifo is more than this register
 * value  it will produce uhci_dma_infifo_full_wm_int interrupt.
 */

#define UHCI_DMA_INFIFO_FULL_THRS    0x00000FFF
#define UHCI_DMA_INFIFO_FULL_THRS_M  (UHCI_DMA_INFIFO_FULL_THRS_V << UHCI_DMA_INFIFO_FULL_THRS_S)
#define UHCI_DMA_INFIFO_FULL_THRS_V  0x00000FFF
#define UHCI_DMA_INFIFO_FULL_THRS_S  9

/* UHCI_SW_START : RW; bitpos: [8]; default: 0;
 * Set this bit to start inserting the packet header.
 */

#define UHCI_SW_START    (BIT(8))
#define UHCI_SW_START_M  (UHCI_SW_START_V << UHCI_SW_START_S)
#define UHCI_SW_START_V  0x00000001
#define UHCI_SW_START_S  8

/* UHCI_WAIT_SW_START : RW; bitpos: [7]; default: 0;
 * Set this bit to enable software way to add packet header.
 */

#define UHCI_WAIT_SW_START    (BIT(7))
#define UHCI_WAIT_SW_START_M  (UHCI_WAIT_SW_START_V << UHCI_WAIT_SW_START_S)
#define UHCI_WAIT_SW_START_V  0x00000001
#define UHCI_WAIT_SW_START_S  7

/* UHCI_CHECK_OWNER : RW; bitpos: [6]; default: 0;
 * Set this bit to check the owner bit in link descriptor.
 */

#define UHCI_CHECK_OWNER    (BIT(6))
#define UHCI_CHECK_OWNER_M  (UHCI_CHECK_OWNER_V << UHCI_CHECK_OWNER_S)
#define UHCI_CHECK_OWNER_V  0x00000001
#define UHCI_CHECK_OWNER_S  6

/* UHCI_TX_ACK_NUM_RE : RW; bitpos: [5]; default: 1;
 * Set this bit to enable hardware replace ack num in packet header
 * automatically.
 */

#define UHCI_TX_ACK_NUM_RE    (BIT(5))
#define UHCI_TX_ACK_NUM_RE_M  (UHCI_TX_ACK_NUM_RE_V << UHCI_TX_ACK_NUM_RE_S)
#define UHCI_TX_ACK_NUM_RE_V  0x00000001
#define UHCI_TX_ACK_NUM_RE_S  5

/* UHCI_TX_CHECK_SUM_RE : RW; bitpos: [4]; default: 1;
 * Set this bit to enable hardware replace check_sum in packet header
 * automatically.
 */

