apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_uhci.h
#define UHCI_TX_CHECK_SUM_RE    (BIT(4))
#define UHCI_TX_CHECK_SUM_RE_M  (UHCI_TX_CHECK_SUM_RE_V << UHCI_TX_CHECK_SUM_RE_S)
#define UHCI_TX_CHECK_SUM_RE_V  0x00000001
#define UHCI_TX_CHECK_SUM_RE_S  4

/* UHCI_SAVE_HEAD : RW; bitpos: [3]; default: 0;
 * Set this bit to save packet header .
 */

#define UHCI_SAVE_HEAD    (BIT(3))
#define UHCI_SAVE_HEAD_M  (UHCI_SAVE_HEAD_V << UHCI_SAVE_HEAD_S)
#define UHCI_SAVE_HEAD_V  0x00000001
#define UHCI_SAVE_HEAD_S  3

/* UHCI_CRC_DISABLE : RW; bitpos: [2]; default: 0;
 * Set this bit to disable crc calculation.
 */

#define UHCI_CRC_DISABLE    (BIT(2))
#define UHCI_CRC_DISABLE_M  (UHCI_CRC_DISABLE_V << UHCI_CRC_DISABLE_S)
#define UHCI_CRC_DISABLE_V  0x00000001
#define UHCI_CRC_DISABLE_S  2

/* UHCI_CHECK_SEQ_EN : RW; bitpos: [1]; default: 1;
 * Set this bit to enable decoder to check seq num in packet header.
 */

#define UHCI_CHECK_SEQ_EN    (BIT(1))
#define UHCI_CHECK_SEQ_EN_M  (UHCI_CHECK_SEQ_EN_V << UHCI_CHECK_SEQ_EN_S)
#define UHCI_CHECK_SEQ_EN_V  0x00000001
#define UHCI_CHECK_SEQ_EN_S  1

/* UHCI_CHECK_SUM_EN : RW; bitpos: [0]; default: 1;
 * Set this bit to enable decoder to check  check_sum in packet header.
 */

#define UHCI_CHECK_SUM_EN    (BIT(0))
#define UHCI_CHECK_SUM_EN_M  (UHCI_CHECK_SUM_EN_V << UHCI_CHECK_SUM_EN_S)
#define UHCI_CHECK_SUM_EN_V  0x00000001
#define UHCI_CHECK_SUM_EN_S  0

/* UHCI_STATE0_REG register */

#define UHCI_STATE0_REG(i) (REG_UHCI_BASE(i) + 0x30)

/* UHCI_STATE0 : R; bitpos: [31:0]; default: 0; */

#define UHCI_STATE0    0xFFFFFFFF
#define UHCI_STATE0_M  (UHCI_STATE0_V << UHCI_STATE0_S)
#define UHCI_STATE0_V  0xFFFFFFFF
#define UHCI_STATE0_S  0

/* UHCI_STATE1_REG register */

#define UHCI_STATE1_REG(i) (REG_UHCI_BASE(i) + 0x34)

/* UHCI_STATE1 : R; bitpos: [31:0]; default: 0; */

#define UHCI_STATE1    0xFFFFFFFF
#define UHCI_STATE1_M  (UHCI_STATE1_V << UHCI_STATE1_S)
#define UHCI_STATE1_V  0xFFFFFFFF
#define UHCI_STATE1_S  0

/* UHCI_DMA_OUT_EOF_DES_ADDR_REG register */

#define UHCI_DMA_OUT_EOF_DES_ADDR_REG(i) (REG_UHCI_BASE(i) + 0x38)

/* UHCI_OUT_EOF_DES_ADDR : R; bitpos: [31:0]; default: 0;
 * This register stores the address of out link descriptoir when eof bit in
 * this descriptor is 1.
 */

#define UHCI_OUT_EOF_DES_ADDR    0xFFFFFFFF
#define UHCI_OUT_EOF_DES_ADDR_M  (UHCI_OUT_EOF_DES_ADDR_V << UHCI_OUT_EOF_DES_ADDR_S)
#define UHCI_OUT_EOF_DES_ADDR_V  0xFFFFFFFF
#define UHCI_OUT_EOF_DES_ADDR_S  0

/* UHCI_DMA_IN_SUC_EOF_DES_ADDR_REG register */

#define UHCI_DMA_IN_SUC_EOF_DES_ADDR_REG(i) (REG_UHCI_BASE(i) + 0x3c)

/* UHCI_IN_SUC_EOF_DES_ADDR : R; bitpos: [31:0]; default: 0;
 * This register stores the address of in link descriptor when eof bit in
 * this descriptor is 1.
 */

#define UHCI_IN_SUC_EOF_DES_ADDR    0xFFFFFFFF
#define UHCI_IN_SUC_EOF_DES_ADDR_M  (UHCI_IN_SUC_EOF_DES_ADDR_V << UHCI_IN_SUC_EOF_DES_ADDR_S)
#define UHCI_IN_SUC_EOF_DES_ADDR_V  0xFFFFFFFF
#define UHCI_IN_SUC_EOF_DES_ADDR_S  0

/* UHCI_DMA_IN_ERR_EOF_DES_ADDR_REG register */

#define UHCI_DMA_IN_ERR_EOF_DES_ADDR_REG(i) (REG_UHCI_BASE(i) + 0x40)

/* UHCI_IN_ERR_EOF_DES_ADDR : R; bitpos: [31:0]; default: 0;
 * This register stores the address of in link descriptor when there are
 * some errors in this descriptor.
 */

#define UHCI_IN_ERR_EOF_DES_ADDR    0xFFFFFFFF
#define UHCI_IN_ERR_EOF_DES_ADDR_M  (UHCI_IN_ERR_EOF_DES_ADDR_V << UHCI_IN_ERR_EOF_DES_ADDR_S)
#define UHCI_IN_ERR_EOF_DES_ADDR_V  0xFFFFFFFF
#define UHCI_IN_ERR_EOF_DES_ADDR_S  0

/* UHCI_DMA_OUT_EOF_BFR_DES_ADDR_REG register */

#define UHCI_DMA_OUT_EOF_BFR_DES_ADDR_REG(i) (REG_UHCI_BASE(i) + 0x44)

/* UHCI_OUT_EOF_BFR_DES_ADDR : R; bitpos: [31:0]; default: 0;
 * This register stores the address of out link descriptor when there are
 * some errors in this descriptor.
 */

#define UHCI_OUT_EOF_BFR_DES_ADDR    0xFFFFFFFF
#define UHCI_OUT_EOF_BFR_DES_ADDR_M  (UHCI_OUT_EOF_BFR_DES_ADDR_V << UHCI_OUT_EOF_BFR_DES_ADDR_S)
#define UHCI_OUT_EOF_BFR_DES_ADDR_V  0xFFFFFFFF
#define UHCI_OUT_EOF_BFR_DES_ADDR_S  0

/* UHCI_AHB_TEST_REG register */

#define UHCI_AHB_TEST_REG(i) (REG_UHCI_BASE(i) + 0x48)

/* UHCI_AHB_TESTADDR : RW; bitpos: [5:4]; default: 0;
 * The two bits represent ahb bus address bit[20:19]
 */

#define UHCI_AHB_TESTADDR    0x00000003
#define UHCI_AHB_TESTADDR_M  (UHCI_AHB_TESTADDR_V << UHCI_AHB_TESTADDR_S)
#define UHCI_AHB_TESTADDR_V  0x00000003
#define UHCI_AHB_TESTADDR_S  4

/* UHCI_AHB_TESTMODE : RW; bitpos: [2:0]; default: 0;
 * bit2 is ahb bus test enable ,bit1 is used to choose write(1) or read(0)
 * mode. bit0 is used to choose test only once(1) or continue(0)
 */

#define UHCI_AHB_TESTMODE    0x00000007
#define UHCI_AHB_TESTMODE_M  (UHCI_AHB_TESTMODE_V << UHCI_AHB_TESTMODE_S)
#define UHCI_AHB_TESTMODE_V  0x00000007
#define UHCI_AHB_TESTMODE_S  0

/* UHCI_DMA_IN_DSCR_REG register */

#define UHCI_DMA_IN_DSCR_REG(i) (REG_UHCI_BASE(i) + 0x4c)

/* UHCI_INLINK_DSCR : R; bitpos: [31:0]; default: 0;
 * The content of current in link descriptor's third dword
 */

#define UHCI_INLINK_DSCR    0xFFFFFFFF
#define UHCI_INLINK_DSCR_M  (UHCI_INLINK_DSCR_V << UHCI_INLINK_DSCR_S)
#define UHCI_INLINK_DSCR_V  0xFFFFFFFF
#define UHCI_INLINK_DSCR_S  0

/* UHCI_DMA_IN_DSCR_BF0_REG register */

#define UHCI_DMA_IN_DSCR_BF0_REG(i) (REG_UHCI_BASE(i) + 0x50)

/* UHCI_INLINK_DSCR_BF0 : R; bitpos: [31:0]; default: 0;
 * The content of current in link descriptor's first dword
 */

#define UHCI_INLINK_DSCR_BF0    0xFFFFFFFF
#define UHCI_INLINK_DSCR_BF0_M  (UHCI_INLINK_DSCR_BF0_V << UHCI_INLINK_DSCR_BF0_S)
#define UHCI_INLINK_DSCR_BF0_V  0xFFFFFFFF
#define UHCI_INLINK_DSCR_BF0_S  0

/* UHCI_DMA_IN_DSCR_BF1_REG register */

#define UHCI_DMA_IN_DSCR_BF1_REG(i) (REG_UHCI_BASE(i) + 0x54)

/* UHCI_INLINK_DSCR_BF1 : R; bitpos: [31:0]; default: 0;
 * The content of current in link descriptor's second dword
 */

#define UHCI_INLINK_DSCR_BF1    0xFFFFFFFF
#define UHCI_INLINK_DSCR_BF1_M  (UHCI_INLINK_DSCR_BF1_V << UHCI_INLINK_DSCR_BF1_S)
#define UHCI_INLINK_DSCR_BF1_V  0xFFFFFFFF
#define UHCI_INLINK_DSCR_BF1_S  0

/* UHCI_DMA_OUT_DSCR_REG register */

#define UHCI_DMA_OUT_DSCR_REG(i) (REG_UHCI_BASE(i) + 0x58)

/* UHCI_OUTLINK_DSCR : R; bitpos: [31:0]; default: 0;
 * The content of current out link descriptor's third dword
 */

