apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_uhci.h
#define UHCI_OUTLINK_DSCR    0xFFFFFFFF
#define UHCI_OUTLINK_DSCR_M  (UHCI_OUTLINK_DSCR_V << UHCI_OUTLINK_DSCR_S)
#define UHCI_OUTLINK_DSCR_V  0xFFFFFFFF
#define UHCI_OUTLINK_DSCR_S  0

/* UHCI_DMA_OUT_DSCR_BF0_REG register */

#define UHCI_DMA_OUT_DSCR_BF0_REG(i) (REG_UHCI_BASE(i) + 0x5c)

/* UHCI_OUTLINK_DSCR_BF0 : R; bitpos: [31:0]; default: 0;
 * The content of current out link descriptor's first dword
 */

#define UHCI_OUTLINK_DSCR_BF0    0xFFFFFFFF
#define UHCI_OUTLINK_DSCR_BF0_M  (UHCI_OUTLINK_DSCR_BF0_V << UHCI_OUTLINK_DSCR_BF0_S)
#define UHCI_OUTLINK_DSCR_BF0_V  0xFFFFFFFF
#define UHCI_OUTLINK_DSCR_BF0_S  0

/* UHCI_DMA_OUT_DSCR_BF1_REG register */

#define UHCI_DMA_OUT_DSCR_BF1_REG(i) (REG_UHCI_BASE(i) + 0x60)

/* UHCI_OUTLINK_DSCR_BF1 : R; bitpos: [31:0]; default: 0;
 * The content of current out link descriptor's second dword
 */

#define UHCI_OUTLINK_DSCR_BF1    0xFFFFFFFF
#define UHCI_OUTLINK_DSCR_BF1_M  (UHCI_OUTLINK_DSCR_BF1_V << UHCI_OUTLINK_DSCR_BF1_S)
#define UHCI_OUTLINK_DSCR_BF1_V  0xFFFFFFFF
#define UHCI_OUTLINK_DSCR_BF1_S  0

/* UHCI_ESCAPE_CONF_REG register */

#define UHCI_ESCAPE_CONF_REG(i) (REG_UHCI_BASE(i) + 0x64)

/* UHCI_RX_13_ESC_EN : RW; bitpos: [7]; default: 0;
 * Set this bit to enable  flow control char 0x13 replace when DMA sends
 * data.
 */

#define UHCI_RX_13_ESC_EN    (BIT(7))
#define UHCI_RX_13_ESC_EN_M  (UHCI_RX_13_ESC_EN_V << UHCI_RX_13_ESC_EN_S)
#define UHCI_RX_13_ESC_EN_V  0x00000001
#define UHCI_RX_13_ESC_EN_S  7

/* UHCI_RX_11_ESC_EN : RW; bitpos: [6]; default: 0;
 * Set this bit to enable  flow control char 0x11 replace when DMA sends
 * data.
 */

#define UHCI_RX_11_ESC_EN    (BIT(6))
#define UHCI_RX_11_ESC_EN_M  (UHCI_RX_11_ESC_EN_V << UHCI_RX_11_ESC_EN_S)
#define UHCI_RX_11_ESC_EN_V  0x00000001
#define UHCI_RX_11_ESC_EN_S  6

/* UHCI_RX_DB_ESC_EN : RW; bitpos: [5]; default: 1;
 * Set this bit to enable  0xdb char replace when DMA sends data.
 */

#define UHCI_RX_DB_ESC_EN    (BIT(5))
#define UHCI_RX_DB_ESC_EN_M  (UHCI_RX_DB_ESC_EN_V << UHCI_RX_DB_ESC_EN_S)
#define UHCI_RX_DB_ESC_EN_V  0x00000001
#define UHCI_RX_DB_ESC_EN_S  5

/* UHCI_RX_C0_ESC_EN : RW; bitpos: [4]; default: 1;
 * Set this bit to enable  0xc0 char replace when DMA sends data.
 */

#define UHCI_RX_C0_ESC_EN    (BIT(4))
#define UHCI_RX_C0_ESC_EN_M  (UHCI_RX_C0_ESC_EN_V << UHCI_RX_C0_ESC_EN_S)
#define UHCI_RX_C0_ESC_EN_V  0x00000001
#define UHCI_RX_C0_ESC_EN_S  4

/* UHCI_TX_13_ESC_EN : RW; bitpos: [3]; default: 0;
 * Set this bit to enable flow control char 0x13 decode when DMA receives
 * data.
 */

#define UHCI_TX_13_ESC_EN    (BIT(3))
#define UHCI_TX_13_ESC_EN_M  (UHCI_TX_13_ESC_EN_V << UHCI_TX_13_ESC_EN_S)
#define UHCI_TX_13_ESC_EN_V  0x00000001
#define UHCI_TX_13_ESC_EN_S  3

/* UHCI_TX_11_ESC_EN : RW; bitpos: [2]; default: 0;
 * Set this bit to enable  flow control char 0x11 decode when DMA receives
 * data.
 */

#define UHCI_TX_11_ESC_EN    (BIT(2))
#define UHCI_TX_11_ESC_EN_M  (UHCI_TX_11_ESC_EN_V << UHCI_TX_11_ESC_EN_S)
#define UHCI_TX_11_ESC_EN_V  0x00000001
#define UHCI_TX_11_ESC_EN_S  2

/* UHCI_TX_DB_ESC_EN : RW; bitpos: [1]; default: 1;
 * Set this bit to enable  0xdb char decode when DMA receives data.
 */

#define UHCI_TX_DB_ESC_EN    (BIT(1))
#define UHCI_TX_DB_ESC_EN_M  (UHCI_TX_DB_ESC_EN_V << UHCI_TX_DB_ESC_EN_S)
#define UHCI_TX_DB_ESC_EN_V  0x00000001
#define UHCI_TX_DB_ESC_EN_S  1

/* UHCI_TX_C0_ESC_EN : RW; bitpos: [0]; default: 1;
 * Set this bit to enable  0xc0 char decode when DMA receives data.
 */

#define UHCI_TX_C0_ESC_EN    (BIT(0))
#define UHCI_TX_C0_ESC_EN_M  (UHCI_TX_C0_ESC_EN_V << UHCI_TX_C0_ESC_EN_S)
#define UHCI_TX_C0_ESC_EN_V  0x00000001
#define UHCI_TX_C0_ESC_EN_S  0

/* UHCI_HUNG_CONF_REG register */

#define UHCI_HUNG_CONF_REG(i) (REG_UHCI_BASE(i) + 0x68)

/* UHCI_RXFIFO_TIMEOUT_ENA : RW; bitpos: [23]; default: 1;
 * This is the enable bit for DMA  send data timeout
 */

#define UHCI_RXFIFO_TIMEOUT_ENA    (BIT(23))
#define UHCI_RXFIFO_TIMEOUT_ENA_M  (UHCI_RXFIFO_TIMEOUT_ENA_V << UHCI_RXFIFO_TIMEOUT_ENA_S)
#define UHCI_RXFIFO_TIMEOUT_ENA_V  0x00000001
#define UHCI_RXFIFO_TIMEOUT_ENA_S  23

/* UHCI_RXFIFO_TIMEOUT_SHIFT : RW; bitpos: [22:20]; default: 0;
 * The tick count is cleared when its value
 * >=(17'd8000>>reg_rxfifo_timeout_shift)
 */

#define UHCI_RXFIFO_TIMEOUT_SHIFT    0x00000007
#define UHCI_RXFIFO_TIMEOUT_SHIFT_M  (UHCI_RXFIFO_TIMEOUT_SHIFT_V << UHCI_RXFIFO_TIMEOUT_SHIFT_S)
#define UHCI_RXFIFO_TIMEOUT_SHIFT_V  0x00000007
#define UHCI_RXFIFO_TIMEOUT_SHIFT_S  20

/* UHCI_RXFIFO_TIMEOUT : RW; bitpos: [19:12]; default: 16;
 * This register stores the timeout value.when DMA takes more time than this
 * register value to read a data from RAM  it will produce  uhci_rx_hung_int
 * interrupt.
 */

#define UHCI_RXFIFO_TIMEOUT    0x000000FF
#define UHCI_RXFIFO_TIMEOUT_M  (UHCI_RXFIFO_TIMEOUT_V << UHCI_RXFIFO_TIMEOUT_S)
#define UHCI_RXFIFO_TIMEOUT_V  0x000000FF
#define UHCI_RXFIFO_TIMEOUT_S  12

/* UHCI_TXFIFO_TIMEOUT_ENA : RW; bitpos: [11]; default: 1;
 * The enable bit for txfifo receive data  timeout
 */

#define UHCI_TXFIFO_TIMEOUT_ENA    (BIT(11))
#define UHCI_TXFIFO_TIMEOUT_ENA_M  (UHCI_TXFIFO_TIMEOUT_ENA_V << UHCI_TXFIFO_TIMEOUT_ENA_S)
#define UHCI_TXFIFO_TIMEOUT_ENA_V  0x00000001
#define UHCI_TXFIFO_TIMEOUT_ENA_S  11

/* UHCI_TXFIFO_TIMEOUT_SHIFT : RW; bitpos: [10:8]; default: 0;
 * The tick count is cleared when its value
 * >=(17'd8000>>reg_txfifo_timeout_shift)
 */

#define UHCI_TXFIFO_TIMEOUT_SHIFT    0x00000007
#define UHCI_TXFIFO_TIMEOUT_SHIFT_M  (UHCI_TXFIFO_TIMEOUT_SHIFT_V << UHCI_TXFIFO_TIMEOUT_SHIFT_S)
#define UHCI_TXFIFO_TIMEOUT_SHIFT_V  0x00000007
#define UHCI_TXFIFO_TIMEOUT_SHIFT_S  8

/* UHCI_TXFIFO_TIMEOUT : RW; bitpos: [7:0]; default: 16;
 * This register stores the timeout value.when DMA takes more time than this
 * register value to receive a data  it will produce  uhci_tx_hung_int
 * interrupt.
 */

#define UHCI_TXFIFO_TIMEOUT    0x000000FF
#define UHCI_TXFIFO_TIMEOUT_M  (UHCI_TXFIFO_TIMEOUT_V << UHCI_TXFIFO_TIMEOUT_S)
#define UHCI_TXFIFO_TIMEOUT_V  0x000000FF
#define UHCI_TXFIFO_TIMEOUT_S  0

/* UHCI_ACK_NUM_REG register */

#define UHCI_ACK_NUM_REG(i) (REG_UHCI_BASE(i) + 0x6c)

/* UHCI_RX_HEAD_REG register */

