apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_uhci.h
#define UHCI_RX_HEAD_REG(i) (REG_UHCI_BASE(i) + 0x70)

/* UHCI_RX_HEAD : R; bitpos: [31:0]; default: 0;
 * This register stores the packet header received by DMA
 */

#define UHCI_RX_HEAD    0xFFFFFFFF
#define UHCI_RX_HEAD_M  (UHCI_RX_HEAD_V << UHCI_RX_HEAD_S)
#define UHCI_RX_HEAD_V  0xFFFFFFFF
#define UHCI_RX_HEAD_S  0

/* UHCI_QUICK_SENT_REG register */

#define UHCI_QUICK_SENT_REG(i) (REG_UHCI_BASE(i) + 0x74)

/* UHCI_ALWAYS_SEND_EN : RW; bitpos: [7]; default: 0;
 * Set this bit to enable continuously send the same short packet
 */

#define UHCI_ALWAYS_SEND_EN    (BIT(7))
#define UHCI_ALWAYS_SEND_EN_M  (UHCI_ALWAYS_SEND_EN_V << UHCI_ALWAYS_SEND_EN_S)
#define UHCI_ALWAYS_SEND_EN_V  0x00000001
#define UHCI_ALWAYS_SEND_EN_S  7

/* UHCI_ALWAYS_SEND_NUM : RW; bitpos: [6:4]; default: 0;
 * The bits are used to choose which short packet
 */

#define UHCI_ALWAYS_SEND_NUM    0x00000007
#define UHCI_ALWAYS_SEND_NUM_M  (UHCI_ALWAYS_SEND_NUM_V << UHCI_ALWAYS_SEND_NUM_S)
#define UHCI_ALWAYS_SEND_NUM_V  0x00000007
#define UHCI_ALWAYS_SEND_NUM_S  4

/* UHCI_SINGLE_SEND_EN : RW; bitpos: [3]; default: 0;
 * Set this bit to enable  send a short packet
 */

#define UHCI_SINGLE_SEND_EN    (BIT(3))
#define UHCI_SINGLE_SEND_EN_M  (UHCI_SINGLE_SEND_EN_V << UHCI_SINGLE_SEND_EN_S)
#define UHCI_SINGLE_SEND_EN_V  0x00000001
#define UHCI_SINGLE_SEND_EN_S  3

/* UHCI_SINGLE_SEND_NUM : RW; bitpos: [2:0]; default: 0;
 * The bits are used to choose which short packet
 */

#define UHCI_SINGLE_SEND_NUM    0x00000007
#define UHCI_SINGLE_SEND_NUM_M  (UHCI_SINGLE_SEND_NUM_V << UHCI_SINGLE_SEND_NUM_S)
#define UHCI_SINGLE_SEND_NUM_V  0x00000007
#define UHCI_SINGLE_SEND_NUM_S  0

/* UHCI_Q0_WORD0_REG register */

#define UHCI_Q0_WORD0_REG(i) (REG_UHCI_BASE(i) + 0x78)

/* UHCI_SEND_Q0_WORD0 : RW; bitpos: [31:0]; default: 0;
 * This register stores the content of short packet's first dword
 */

#define UHCI_SEND_Q0_WORD0    0xFFFFFFFF
#define UHCI_SEND_Q0_WORD0_M  (UHCI_SEND_Q0_WORD0_V << UHCI_SEND_Q0_WORD0_S)
#define UHCI_SEND_Q0_WORD0_V  0xFFFFFFFF
#define UHCI_SEND_Q0_WORD0_S  0

/* UHCI_Q0_WORD1_REG register */

#define UHCI_Q0_WORD1_REG(i) (REG_UHCI_BASE(i) + 0x7c)

/* UHCI_SEND_Q0_WORD1 : RW; bitpos: [31:0]; default: 0;
 * This register stores the content of short packet's second dword
 */

#define UHCI_SEND_Q0_WORD1    0xFFFFFFFF
#define UHCI_SEND_Q0_WORD1_M  (UHCI_SEND_Q0_WORD1_V << UHCI_SEND_Q0_WORD1_S)
#define UHCI_SEND_Q0_WORD1_V  0xFFFFFFFF
#define UHCI_SEND_Q0_WORD1_S  0

/* UHCI_Q1_WORD0_REG register */

#define UHCI_Q1_WORD0_REG(i) (REG_UHCI_BASE(i) + 0x80)

/* UHCI_SEND_Q1_WORD0 : RW; bitpos: [31:0]; default: 0;
 * This register stores the content of short packet's first dword
 */

#define UHCI_SEND_Q1_WORD0    0xFFFFFFFF
#define UHCI_SEND_Q1_WORD0_M  (UHCI_SEND_Q1_WORD0_V << UHCI_SEND_Q1_WORD0_S)
#define UHCI_SEND_Q1_WORD0_V  0xFFFFFFFF
#define UHCI_SEND_Q1_WORD0_S  0

/* UHCI_Q1_WORD1_REG register */

#define UHCI_Q1_WORD1_REG(i) (REG_UHCI_BASE(i) + 0x84)

/* UHCI_SEND_Q1_WORD1 : RW; bitpos: [31:0]; default: 0;
 * This register stores the content of short packet's second dword
 */

#define UHCI_SEND_Q1_WORD1    0xFFFFFFFF
#define UHCI_SEND_Q1_WORD1_M  (UHCI_SEND_Q1_WORD1_V << UHCI_SEND_Q1_WORD1_S)
#define UHCI_SEND_Q1_WORD1_V  0xFFFFFFFF
#define UHCI_SEND_Q1_WORD1_S  0

/* UHCI_Q2_WORD0_REG register */

#define UHCI_Q2_WORD0_REG(i) (REG_UHCI_BASE(i) + 0x88)

/* UHCI_SEND_Q2_WORD0 : RW; bitpos: [31:0]; default: 0;
 * This register stores the content of short packet's first dword
 */

#define UHCI_SEND_Q2_WORD0    0xFFFFFFFF
#define UHCI_SEND_Q2_WORD0_M  (UHCI_SEND_Q2_WORD0_V << UHCI_SEND_Q2_WORD0_S)
#define UHCI_SEND_Q2_WORD0_V  0xFFFFFFFF
#define UHCI_SEND_Q2_WORD0_S  0

/* UHCI_Q2_WORD1_REG register */

#define UHCI_Q2_WORD1_REG(i) (REG_UHCI_BASE(i) + 0x8c)

/* UHCI_SEND_Q2_WORD1 : RW; bitpos: [31:0]; default: 0;
 * This register stores the content of short packet's second dword
 */

#define UHCI_SEND_Q2_WORD1    0xFFFFFFFF
#define UHCI_SEND_Q2_WORD1_M  (UHCI_SEND_Q2_WORD1_V << UHCI_SEND_Q2_WORD1_S)
#define UHCI_SEND_Q2_WORD1_V  0xFFFFFFFF
#define UHCI_SEND_Q2_WORD1_S  0

/* UHCI_Q3_WORD0_REG register */

#define UHCI_Q3_WORD0_REG(i) (REG_UHCI_BASE(i) + 0x90)

/* UHCI_SEND_Q3_WORD0 : RW; bitpos: [31:0]; default: 0;
 * This register stores the content of short packet's first dword
 */

#define UHCI_SEND_Q3_WORD0    0xFFFFFFFF
#define UHCI_SEND_Q3_WORD0_M  (UHCI_SEND_Q3_WORD0_V << UHCI_SEND_Q3_WORD0_S)
#define UHCI_SEND_Q3_WORD0_V  0xFFFFFFFF
#define UHCI_SEND_Q3_WORD0_S  0

/* UHCI_Q3_WORD1_REG register */

#define UHCI_Q3_WORD1_REG(i) (REG_UHCI_BASE(i) + 0x94)

/* UHCI_SEND_Q3_WORD1 : RW; bitpos: [31:0]; default: 0;
 * This register stores the content of short packet's second dword
 */

#define UHCI_SEND_Q3_WORD1    0xFFFFFFFF
#define UHCI_SEND_Q3_WORD1_M  (UHCI_SEND_Q3_WORD1_V << UHCI_SEND_Q3_WORD1_S)
#define UHCI_SEND_Q3_WORD1_V  0xFFFFFFFF
#define UHCI_SEND_Q3_WORD1_S  0

/* UHCI_Q4_WORD0_REG register */

#define UHCI_Q4_WORD0_REG(i) (REG_UHCI_BASE(i) + 0x98)

/* UHCI_SEND_Q4_WORD0 : RW; bitpos: [31:0]; default: 0;
 * This register stores the content of short packet's first dword
 */

#define UHCI_SEND_Q4_WORD0    0xFFFFFFFF
#define UHCI_SEND_Q4_WORD0_M  (UHCI_SEND_Q4_WORD0_V << UHCI_SEND_Q4_WORD0_S)
#define UHCI_SEND_Q4_WORD0_V  0xFFFFFFFF
#define UHCI_SEND_Q4_WORD0_S  0

/* UHCI_Q4_WORD1_REG register */

#define UHCI_Q4_WORD1_REG(i) (REG_UHCI_BASE(i) + 0x9c)

/* UHCI_SEND_Q4_WORD1 : RW; bitpos: [31:0]; default: 0;
 * This register stores the content of short packet's second dword
 */

#define UHCI_SEND_Q4_WORD1    0xFFFFFFFF
#define UHCI_SEND_Q4_WORD1_M  (UHCI_SEND_Q4_WORD1_V << UHCI_SEND_Q4_WORD1_S)
#define UHCI_SEND_Q4_WORD1_V  0xFFFFFFFF
#define UHCI_SEND_Q4_WORD1_S  0

/* UHCI_Q5_WORD0_REG register */

#define UHCI_Q5_WORD0_REG(i) (REG_UHCI_BASE(i) + 0xa0)

/* UHCI_SEND_Q5_WORD0 : RW; bitpos: [31:0]; default: 0;
 * This register stores the content of short packet's first dword
 */

#define UHCI_SEND_Q5_WORD0    0xFFFFFFFF
#define UHCI_SEND_Q5_WORD0_M  (UHCI_SEND_Q5_WORD0_V << UHCI_SEND_Q5_WORD0_S)
#define UHCI_SEND_Q5_WORD0_V  0xFFFFFFFF
#define UHCI_SEND_Q5_WORD0_S  0

/* UHCI_Q5_WORD1_REG register */

