apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_uhci.h
#define UHCI_Q5_WORD1_REG(i) (REG_UHCI_BASE(i) + 0xa4)

/* UHCI_SEND_Q5_WORD1 : RW; bitpos: [31:0]; default: 0;
 * This register stores the content of short packet's second dword
 */

#define UHCI_SEND_Q5_WORD1    0xFFFFFFFF
#define UHCI_SEND_Q5_WORD1_M  (UHCI_SEND_Q5_WORD1_V << UHCI_SEND_Q5_WORD1_S)
#define UHCI_SEND_Q5_WORD1_V  0xFFFFFFFF
#define UHCI_SEND_Q5_WORD1_S  0

/* UHCI_Q6_WORD0_REG register */

#define UHCI_Q6_WORD0_REG(i) (REG_UHCI_BASE(i) + 0xa8)

/* UHCI_SEND_Q6_WORD0 : RW; bitpos: [31:0]; default: 0;
 * This register stores the content of short packet's first dword
 */

#define UHCI_SEND_Q6_WORD0    0xFFFFFFFF
#define UHCI_SEND_Q6_WORD0_M  (UHCI_SEND_Q6_WORD0_V << UHCI_SEND_Q6_WORD0_S)
#define UHCI_SEND_Q6_WORD0_V  0xFFFFFFFF
#define UHCI_SEND_Q6_WORD0_S  0

/* UHCI_Q6_WORD1_REG register */

#define UHCI_Q6_WORD1_REG(i) (REG_UHCI_BASE(i) + 0xac)

/* UHCI_SEND_Q6_WORD1 : RW; bitpos: [31:0]; default: 0;
 * This register stores the content of short packet's second dword
 */

#define UHCI_SEND_Q6_WORD1    0xFFFFFFFF
#define UHCI_SEND_Q6_WORD1_M  (UHCI_SEND_Q6_WORD1_V << UHCI_SEND_Q6_WORD1_S)
#define UHCI_SEND_Q6_WORD1_V  0xFFFFFFFF
#define UHCI_SEND_Q6_WORD1_S  0

/* UHCI_ESC_CONF0_REG register */

#define UHCI_ESC_CONF0_REG(i) (REG_UHCI_BASE(i) + 0xb0)

/* UHCI_SEPER_ESC_CHAR1 : RW; bitpos: [23:16]; default: 220;
 * This register stores the second char used to replace separator char in
 * data . 0xdc 0xdb replace 0xc0 by default.
 */

#define UHCI_SEPER_ESC_CHAR1    0x000000FF
#define UHCI_SEPER_ESC_CHAR1_M  (UHCI_SEPER_ESC_CHAR1_V << UHCI_SEPER_ESC_CHAR1_S)
#define UHCI_SEPER_ESC_CHAR1_V  0x000000FF
#define UHCI_SEPER_ESC_CHAR1_S  16

/* UHCI_SEPER_ESC_CHAR0 : RW; bitpos: [15:8]; default: 219;
 * This register stores thee first char used to replace separator char in
 * data.
 */

#define UHCI_SEPER_ESC_CHAR0    0x000000FF
#define UHCI_SEPER_ESC_CHAR0_M  (UHCI_SEPER_ESC_CHAR0_V << UHCI_SEPER_ESC_CHAR0_S)
#define UHCI_SEPER_ESC_CHAR0_V  0x000000FF
#define UHCI_SEPER_ESC_CHAR0_S  8

/* UHCI_SEPER_CHAR : RW; bitpos: [7:0]; default: 192;
 * This register stores the separator char  separator char is used to
 * separate the data frame.
 */

#define UHCI_SEPER_CHAR    0x000000FF
#define UHCI_SEPER_CHAR_M  (UHCI_SEPER_CHAR_V << UHCI_SEPER_CHAR_S)
#define UHCI_SEPER_CHAR_V  0x000000FF
#define UHCI_SEPER_CHAR_S  0

/* UHCI_ESC_CONF1_REG register */

#define UHCI_ESC_CONF1_REG(i) (REG_UHCI_BASE(i) + 0xb4)

/* UHCI_ESC_SEQ0_CHAR1 : RW; bitpos: [23:16]; default: 221;
 * This register stores the second char used to replace the reg_esc_seq0 in
 * data
 */

#define UHCI_ESC_SEQ0_CHAR1    0x000000FF
#define UHCI_ESC_SEQ0_CHAR1_M  (UHCI_ESC_SEQ0_CHAR1_V << UHCI_ESC_SEQ0_CHAR1_S)
#define UHCI_ESC_SEQ0_CHAR1_V  0x000000FF
#define UHCI_ESC_SEQ0_CHAR1_S  16

/* UHCI_ESC_SEQ0_CHAR0 : RW; bitpos: [15:8]; default: 219;
 * This register stores the first char used to replace reg_esc_seq0 in data.
 */

#define UHCI_ESC_SEQ0_CHAR0    0x000000FF
#define UHCI_ESC_SEQ0_CHAR0_M  (UHCI_ESC_SEQ0_CHAR0_V << UHCI_ESC_SEQ0_CHAR0_S)
#define UHCI_ESC_SEQ0_CHAR0_V  0x000000FF
#define UHCI_ESC_SEQ0_CHAR0_S  8

/* UHCI_ESC_SEQ0 : RW; bitpos: [7:0]; default: 219;
 * This register stores the first substitute char used to replace the
 * separator char.
 */

#define UHCI_ESC_SEQ0    0x000000FF
#define UHCI_ESC_SEQ0_M  (UHCI_ESC_SEQ0_V << UHCI_ESC_SEQ0_S)
#define UHCI_ESC_SEQ0_V  0x000000FF
#define UHCI_ESC_SEQ0_S  0

/* UHCI_ESC_CONF2_REG register */

#define UHCI_ESC_CONF2_REG(i) (REG_UHCI_BASE(i) + 0xb8)

/* UHCI_ESC_SEQ1_CHAR1 : RW; bitpos: [23:16]; default: 222;
 * This register stores the second char used to replace the reg_esc_seq1 in
 * data.
 */

#define UHCI_ESC_SEQ1_CHAR1    0x000000FF
#define UHCI_ESC_SEQ1_CHAR1_M  (UHCI_ESC_SEQ1_CHAR1_V << UHCI_ESC_SEQ1_CHAR1_S)
#define UHCI_ESC_SEQ1_CHAR1_V  0x000000FF
#define UHCI_ESC_SEQ1_CHAR1_S  16

/* UHCI_ESC_SEQ1_CHAR0 : RW; bitpos: [15:8]; default: 219;
 * This register stores the first char used to replace the reg_esc_seq1 in
 * data.
 */

#define UHCI_ESC_SEQ1_CHAR0    0x000000FF
#define UHCI_ESC_SEQ1_CHAR0_M  (UHCI_ESC_SEQ1_CHAR0_V << UHCI_ESC_SEQ1_CHAR0_S)
#define UHCI_ESC_SEQ1_CHAR0_V  0x000000FF
#define UHCI_ESC_SEQ1_CHAR0_S  8

/* UHCI_ESC_SEQ1 : RW; bitpos: [7:0]; default: 17;
 * This register stores the flow control char to turn on the flow_control
 */

#define UHCI_ESC_SEQ1    0x000000FF
#define UHCI_ESC_SEQ1_M  (UHCI_ESC_SEQ1_V << UHCI_ESC_SEQ1_S)
#define UHCI_ESC_SEQ1_V  0x000000FF
#define UHCI_ESC_SEQ1_S  0

/* UHCI_ESC_CONF3_REG register */

#define UHCI_ESC_CONF3_REG(i) (REG_UHCI_BASE(i) + 0xbc)

/* UHCI_ESC_SEQ2_CHAR1 : RW; bitpos: [23:16]; default: 223;
 * This register stores  the second char used to replace the reg_esc_seq2 in
 * data.
 */

#define UHCI_ESC_SEQ2_CHAR1    0x000000FF
#define UHCI_ESC_SEQ2_CHAR1_M  (UHCI_ESC_SEQ2_CHAR1_V << UHCI_ESC_SEQ2_CHAR1_S)
#define UHCI_ESC_SEQ2_CHAR1_V  0x000000FF
#define UHCI_ESC_SEQ2_CHAR1_S  16

/* UHCI_ESC_SEQ2_CHAR0 : RW; bitpos: [15:8]; default: 219;
 * This register stores the first char used to replace the reg_esc_seq2 in
 * data.
 */

#define UHCI_ESC_SEQ2_CHAR0    0x000000FF
#define UHCI_ESC_SEQ2_CHAR0_M  (UHCI_ESC_SEQ2_CHAR0_V << UHCI_ESC_SEQ2_CHAR0_S)
#define UHCI_ESC_SEQ2_CHAR0_V  0x000000FF
#define UHCI_ESC_SEQ2_CHAR0_S  8

/* UHCI_ESC_SEQ2 : RW; bitpos: [7:0]; default: 19;
 * This register stores the flow_control char to turn off the flow_control
 */

#define UHCI_ESC_SEQ2    0x000000FF
#define UHCI_ESC_SEQ2_M  (UHCI_ESC_SEQ2_V << UHCI_ESC_SEQ2_S)
#define UHCI_ESC_SEQ2_V  0x000000FF
#define UHCI_ESC_SEQ2_S  0

/* UHCI_PKT_THRES_REG register */

#define UHCI_PKT_THRES_REG(i) (REG_UHCI_BASE(i) + 0xc0)

/* UHCI_PKT_THRS : RW; bitpos: [12:0]; default: 128;
 * when the amount of packet payload is greater than this value the process
 * of receiving data is done.
 */

#define UHCI_PKT_THRS    0x00001FFF
#define UHCI_PKT_THRS_M  (UHCI_PKT_THRS_V << UHCI_PKT_THRS_S)
#define UHCI_PKT_THRS_V  0x00001FFF
#define UHCI_PKT_THRS_S  0

/* UHCI_DATE_REG register */

#define UHCI_DATE_REG(i) (REG_UHCI_BASE(i) + 0xfc)

/* UHCI_DATE : RW; bitpos: [31:0]; default: 369364993;
 * version information
 */

#define UHCI_DATE    0xFFFFFFFF
#define UHCI_DATE_M  (UHCI_DATE_V << UHCI_DATE_S)
#define UHCI_DATE_V  0xFFFFFFFF
#define UHCI_DATE_S  0

#endif /* __ARCH_XTENSA_SRC_ESP32_HARDWARE_ESP32_UHCI_H */
